{
  "board": "ICSE",
  "grade": 9,
  "subject": "Geography",
  "book_slug": "TotalGeography_MorningStar_JasmineRachel",
  "book_meta": {
    "book_name": "Total Geography",
    "publication": "Morning Star",
    "author": "Jasmine Rachel"
  },
  "chapter_sequence_number": 2,
  "chapter_title": "Geographic Grid: Latitudes and Longitudes",
  "discipline": null,
  "reconciliation": {
    "outline": [
      "LINES OF LATITUDE",
      "Main Latitudes",
      "Northern and Southern Hemisphere",
      "Uses of Latitudes",
      "Heat Zones",
      "LINES OF LONGITUDE",
      "LONGITUDE AND TIME",
      "Difference between Lines of Latitude and Lines of Longitude",
      "Eastern and Western Hemisphere",
      "LOCAL TIME",
      "TIME ZONES AND STANDARD TIME",
      "Time Zones",
      "Standard Time",
      "Greenwich Mean Time",
      "Indian Standard Time (IST)",
      "Worked Out Example for calculating the Time at a place",
      "INTERNATIONAL DATE LINE",
      "LOCATING PLACES",
      "Worked Out Examples",
      "GREAT AND SMALL CIRCLES",
      "Characteristics of a Great Circle",
      "Uses of Great Circles"
    ],
    "in_syllabus_only": [],
    "in_pdf_only": [
      {
        "title": "Difference between Lines of Latitude and Lines of Longitude",
        "insert_after_index": 11,
        "micro_topics": []
      },
      {
        "title": "Time Zones",
        "insert_after_index": 14,
        "micro_topics": []
      },
      {
        "title": "Standard Time",
        "insert_after_index": 14,
        "micro_topics": []
      },
      {
        "title": "Greenwich Mean Time",
        "insert_after_index": 14,
        "micro_topics": []
      },
      {
        "title": "Worked Out Example for calculating the Time at a place",
        "insert_after_index": 15,
        "micro_topics": []
      },
      {
        "title": "Worked Out Examples",
        "insert_after_index": 17,
        "micro_topics": []
      },
      {
        "title": "Characteristics of a Great Circle",
        "insert_after_index": 18,
        "micro_topics": []
      }
    ],
    "additional_sections": [
      {
        "title": "Difference between Lines of Latitude and Lines of Longitude",
        "content_md": "| Latitude | Longitude |\n| :--- | :--- |\n| 1. A latitude is the angular distance of a place north or south of the Equator. | 1. A longitude is the angular distance of a place east or west of the Prime Meridian. |\n| 2. Lines of Latitude are parallel to the Equator and each other. | 2. All meridians of longitude converge at the poles. |\n| 3. Each parallel of latitude is a full circle. The lines of latitude are not of equal length and become smaller on moving towards the poles. | 3. Individually all lines of longitude are semicircles and of equal length. |\n| 4. Latitude degrees are measured from the Equator to its north or south. | 4. Longitude degrees are measured from the Prime meridian to its east or west. |\n| 5. The distance between two lines of latitude is approximately 111 km. | 5. The distance between two lines of longitude is maximum at the Equator, i.e., 111 km, but it goes on decreasing on moving towards the poles. It is 0° at the poles. |\n| 6. Lines of latitude are used to find the location of a place, to measure the distance of a place and to divide the whole earth into different heat or climatic zones. | 6. Lines of longitude are used to find the local and standard time of a place. Along with the lines of latitude, the longitudes are used to locate places on the globe or a map. |"
      },
      {
        "title": "Time Zones",
        "content_md": "To overcome the confusion while allowing the interplay of natural forces to operate, the earth has been divided into 24 Time Zones according to the number of hours in a day. Each zone covers 15° longitude (360 ÷ 24). The time for the whole zone is determined on the basis of the central meridian of that place. While countries with smaller east-west extent like India have only one Standard Time Zone, countries like Russia, Canada, USA have more than one Time Zones."
      },
      {
        "title": "Standard Time",
        "content_md": "The uniform time based on a central meridian is known as the Standard Time. Standard time must always be divisible by 7½°. This allows time to be reckoned by a unit of half-an-hour and not smaller differences."
      },
      {
        "title": "Greenwich Mean Time",
        "content_md": "Further, while fixing the Time Zones, the time at Greenwich (0° longitude) has been selected as the mean time. Thus, if it is 12 Noon at Greenwich, at 15°E longitude, the time will be 1 pm and at 30°E longitude, the time will be 2 pm. The time fixed with reference to Greenwich is called the Greenwich Mean Time or GMT."
      },
      {
        "title": "Worked Out Example for calculating the Time at a place",
        "content_md": "**Example:** It is 5.30 p.m. in India when the Prime Minister's radio broadcast made from Montreal in Canada was heard. What must have been the time at Montreal?\n\n**Solution 1:** After consulting the atlas we find Montreal lies 74°W.\nTime in India = 1730 hrs (5:30 PM)\n∴ India is ahead of GMT = 5 hrs 30 m\n∴ Time at Greenwich = 1200 hrs. (noon)\n∴ Montreal Time difference with respect to GMT\n= 296 min. (74 × 4 min.)\n= 4 hours 56 minutes\nMontreal is to the west of GMT, its time\n= 12 hrs - 4 hours 56 min.\n= 7:04 a.m.\n\n**Solution 2:** Standard Meridian of India = 82½°E\nStandard Meridian of Montreal = 74°W\nTotal meridians = 156½°\nMeridian = 4 minutes\n156½° meridian = 626 minutes (156½° × 4)\n= 10 hrs 26 minutes\nMontreal is to the west of Delhi, therefore, time difference will be deducted = 1730 hrs - 1026 hrs = 7.04 a.m. in Montreal.\n\n∴ The Prime Minister made his broadcast at 7.04 AM from Montreal which was received at 5.30 p.m. in India."
      },
      {
        "title": "Worked Out Examples",
        "content_md": "The latitude and longitude of three places is given below. Pinpoint these places on the globe.\n(i) New York – Latitude 41°N and Longitude 74°W\n(ii) New Delhi – 30°N and 77°E\n(iii) Mumbai – 19°N and 73°E\n\nFirst look at the data of New York. It is a common practice to write first the latitude and then the longitude of a place. For locating the above, identify the relevant latitudes and longitudes. Where the two lines meet, or the point at which they cross each other, lies the place which is to be located."
      },
      {
        "title": "Characteristics of a Great Circle",
        "content_md": "(i) A great circle is a theoretical circle formed by the intersection of the earth's surface and an imaginary plane that passes through the centre of the earth and divides it into two equal parts.\n(ii) All such circles must pass through or touch the centre of the circle.\n(iii) Infinite number of circles that touch the two opposite ends of the sphere can be drawn on a sphere.\n(iv) Intersecting great circles always bisect each other."
      }
    ]
  },
  "nodes": [
    {
      "title": "Geographic Grid: Latitudes and Longitudes",
      "sequence_number": 1,
      "depth": 0,
      "level_label": "Section",
      "children": [
        {
          "title": "Concept of latitudes: main latitudes, their location with degrees, parallels of latitude and their uses.",
          "sequence_number": 1,
          "depth": 1,
          "level_label": "Topic",
          "children": [],
          "content_blocks": [
            {
              "content_md": "### LINES OF LATITUDE\n*   **Lines of Latitude** are the imaginary lines joining all places having the same latitude towards north or south of the **Equator**.\n*   A **latitude** is the angular distance of a place north or south of the **Equator**.\n*   A latitude is marked in **degrees**, with the **Equator** being 0 degrees.\n*   Latitudes are calculated according to the angle a place makes with the centre of the earth.\n*   Since the lines of latitude are parallel to the **Equator** and each other, they are called **parallels of latitude**.\n*   Each parallel of latitude is a full circle. However, only the **Equator** is a **Great Circle**.\n\n[Image: Fig. 2.2. (a) Latitude degrees are measured from the Equator to its north or south]\n\nThe **lines of latitude** are not of equal length and become smaller as we move towards the poles. At 60° latitude, in each hemisphere the length of the circle is half the length of the **Equator**. At the poles these lines are just points or dots."
            },
            {
              "content_md": "### Main Latitudes\nThere are **181 parallels of latitude** at 1° interval.\n*   **Equator** is the longest line of latitude. It represents **0° latitude**.\n*   The **North Pole (90° N)** is located at an angular distance of 90° north of the Equator.\n*   The **South Pole (90° S)** is located at an angular distance of 90° south of the Equator.\n*   The **Tropic of Cancer (23½°N)** is a line of latitude located 23½° north of the Equator.\n*   The **Tropic of Capricorn (23½°S)** is a line of latitude located 23½° south of the Equator.\n*   The **Arctic Circle** represents **66½°N** latitude. The Arctic Circle marks the limit of the north polar region surrounding the North Pole.\n*   The **Antarctic Circle** represents **66½°S** latitude. The Antarctic Circle marks the limit of the south polar region around the South Pole.\n\n### Northern and Southern Hemisphere\nThe **Equator** that runs midway between the poles divides the earth into two equal hemispheres known as the **Northern Hemisphere** and the **Southern Hemisphere**.\nThe Poles—**North Pole** and **South Pole**—are opposite to each other at the extreme ends of the sphere. They are each located at 90° angular distance north or south of the **Equator**.\nThe length of the **Equator** is equal to the circumference of the earth or **40,075 km**. Since the circumference of a circle is equal to 360°, the **1° angular distance** is roughly equal to **111 km**."
            },
            {
              "content_md": "### Uses of Latitudes\nThe lines of latitude form one of the coordinates of the grid system. The lines of latitude have the following uses:\n\n**To find the location of a Place:** Latitudes give us the location of a place north or south of the Equator. Such a location is known as an **absolute location**.\n\n**To measure the distance of a Place:** Distances are calculated with reference to the Equator at right angle to the place. We can therefore, measure the distance of any place from the Equator based on its degree of latitude. For example, the latitude of Mumbai is 19°N and that of New Delhi is 30°N. We know that 1° latitude = 111 km. We can say that Mumbai is 2109 km (111 × 19°) away from Equator. Similarly, New Delhi is 3,330 km (111 × 30°) away from Equator.\n\n[Image: Fig. 2.3. Important Parallels of Latitudes]\n\n**Heat Zones:** Besides helping us to locate places on maps and charts, lines of latitude divide the earth into distinct heat belts. The lines of latitude indicate the general climate of the area by applying the principle of **heat zones** or **thermal zones** of the earth. Thus, latitudes enable us to divide the whole earth into different climatic zones.\n*   **The Torrid or Tropical Zone:** The area lying between the **Tropic of Cancer (23½°N)** and **Tropic of Capricorn (23½°S)** mark the limits of the **Torrid** (meaning very hot) Zone. It is also called the **Tropical Zone**. It is the hottest zone of the earth.\n*   **The Temperate Zones:** Two other important lines of latitude based on temperature are the **Arctic Circle (66½°N)** and the **Antarctic Circle (66½°S)**. Between the Arctic Circle and the Tropic of Cancer as well as between the Antarctic Circle and the Tropic of Capricorn lie the two **Temperate Zones** — the **North Temperate (23½°N to 66½°N)** and the **South Temperate zones (23½°S to 66½°S)**. In this region, the climate is moderate, i.e., neither too hot nor too cold.\n*   **The Frigid Zones:** Between the Arctic Circle and the North Pole and between the Antarctic Circle and the South Pole are the two **Frigid Zones** of the earth. These are the polar regions and receive the sun's slanting rays. In these two zones, very low temperatures are recorded."
            }
          ]
        },
        {
          "title": "Concept of longitudes — Prime Meridian, time (local, standard and time zones, Greenwich Mean Time (GMT) and International Date Line (IDL). Eastern and Western hemisphere.",
          "sequence_number": 2,
          "depth": 1,
          "level_label": "Topic",
          "children": [],
          "content_blocks": [
            {
              "content_md": "### LINES OF LONGITUDE\n\nA **longitude** is the angular distance of a place east or west of the **Prime Meridian**.\n\n*   The **Prime Meridian** is the line of longitude whose angular distance is defined as **0°**. It passes through Greenwich near London.\n*   The lines to the west of Greenwich are suffixed with ‘W’ and those east of Greenwich are suffixed with ‘E’. For example 60°W and 60°E.\n*   There are a total of **360 lines** at 1° interval.\n*   The lines of longitude are also called **Meridians of Longitude**. 'Meridian' is derived from the Latin word ‘meridianum’ meaning noon. The sun crosses a meridian at noon. All places on a particular meridian will have noon at the same time."
            },
            {
              "content_md": "**Characteristics of Meridians of Longitude:**\n*   All meridians of longitude converge at the poles and are thus of **equal length**.\n*   The Prime Meridian is numbered as 0°. The others are numbered between 0° to 180°E or W. The line 180°E and W refer to the same meridian. It is diametrically opposite to the 0° longitude. Thus 0° and 180° meridian together make a full circle round the earth. Individually all lines of longitude are **semicircles**.\n*   The two diametrically opposite lines make a full circle also known as the **Great Circle**.\n*   The distance between two lines of longitude is maximum at the **Equator (111 km)**. The distance decreases gradually as one moves towards the poles.\n\n[Image: Fig. 2.4. Lines of Longitude]"
            },
            {
              "content_md": "### LONGITUDE AND TIME\nThe lines of longitude, as stated earlier, are also known as the ‘Meridians’. At a particular moment of time, if it is 12 Noon at a given longitude, it must be 12 Noon at all places on this longitude.\n\nThe **Earth** makes a complete circle on its axis—it covers **360° longitudes in 24 hours**. That is to say, it covers every **15° longitudes in one hour** or **1° longitude every 4 minutes**. Thus, if it is 12 Noon at 0° longitude, it must be 4 minutes past 12 Noon towards the east at the next 1°E longitude or at 15°E longitude it must be 1 p.m. Towards the west, it will be 1 hour less because the Earth rotates from West to East as the sun first rises in the East. For the purpose of memorising, **EGA-WLS** formula is used. **EGA** stands for **East-Gain-Add** and **WLS** means **West-Lose-Subtract**. This in other words means that for each 1° longitude towards the East, 4 minutes are to be added and each 1° longitude towards the West, 4 minutes are to be subtracted."
            },
            {
              "content_md": "### Eastern and Western Hemisphere\nThe **Prime Meridian**, together with the **180° longitude** usually divides the earth into the **Eastern** and **Western Hemispheres**. This division holds good practically for all purposes. However, any two diametrically opposite lines can also divide the earth into two equal hemispheres."
            },
            {
              "content_md": "### LOCAL TIME\nThe **local time** of any place is obtained by the overhead sun at noon. For each degree of longitude, the local time varies by 4 minutes. For example, the longitude of Mumbai is 73°E and that of New Delhi is 77°E. If it is 12 Noon at Mumbai (73°E) it must be 16 minutes past 12 Noon at New Delhi at the same time (77°E – 73°E = 4° longitude difference. 1° longitude = 4 minutes 4° longitude = 16 minutes which is to be added because Delhi lies to the east of Mumbai). This means that there will be a huge time difference between Gujarat in the west and Assam in the east. Every place at a different longitude will have its own local time."
            },
            {
              "content_md": "### TIME ZONES AND STANDARD TIME\n\n**Time Zones**\nTo overcome the confusion while allowing the interplay of natural forces to operate, the earth has been divided into **24 Time Zones** according to the number of hours in a day. Each zone covers **15° longitude** (360 ÷ 24). The time for the whole zone is determined on the basis of the central meridian of that place. While countries with smaller east-west extent like India have only one Standard Time Zone, countries like Russia, Canada, USA have more than one Time Zones.\n\n**Standard Time**\nThe uniform time based on a central meridian is known as the **Standard Time**. Standard time must always be divisible by 7½°. This allows time to be reckoned by a unit of half-an-hour and not smaller differences."
            },
            {
              "content_md": "### Greenwich Mean Time (GMT)\nFurther, while fixing the Time Zones, the time at **Greenwich (0° longitude)** has been selected as the mean time. Thus, if it is 12 Noon at Greenwich, at 15°E longitude, the time will be 1 pm and at 30°E longitude, the time will be 2 pm. The time fixed with reference to Greenwich is called the **Greenwich Mean Time** or **GMT**.\n\n[Image: Fig. 2.5. Places on the same longitude have the same time — Places K, O and M have each 40° longitude. If it is 12 noon at K, it will also be 12 noon at O and M]"
            },
            {
              "content_md": "### INTERNATIONAL DATE LINE\nThe line of longitude **180°** is one and the same for East or West of the Prime Meridian. Since it is diametrically opposite to the Greenwich Meridian it causes a time difference of a full day on crossing the line. The time difference works out to 12 hours (180° × 4 min) from either side. Thus, on crossing the line, a day is gained or lost.\n\nThe **International Date Line (IDL)** is the 180° line. When crossing this date line the date changes. When crossing the International Date Line from west to east, a day is gained (e.g., Monday becomes Sunday). When crossing from east to west, a day is lost (e.g., Sunday becomes Monday).\n\nTo avoid the confusion of having different dates within the same country, the **Date Line bends and goes zig-zag** at the Bering Strait between Siberia and Alaska and at Fiji, Tonga, New Zealand and some other islands.\n\n[Image: Fig. 2.6. The International Date Line]"
            }
          ]
        },
        {
          "title": "Using latitudes and longitudes to find location. Calculation of time.",
          "sequence_number": 3,
          "depth": 1,
          "level_label": "Topic",
          "children": [],
          "content_blocks": [
            {
              "content_md": "With the help of the **grid**, we can locate places on the globe or the map, if we know the **latitude and longitude** of those places."
            },
            {
              "content_md": "### Worked Out Examples\nThe latitude and longitude of three places is given below. Pinpoint these places on the globe.\n(i) New York – Latitude 41°N and Longitude 74°W\n(ii) New Delhi – 30°N and 77°E\n(iii) Mumbai – 19°N and 73°E\n\nFirst look at the data of New York. It is a common practice to write first the latitude and then the longitude of a place. For locating the above, identify the relevant latitudes and longitudes. Where the two lines meet, or the point at which they cross each other, lies the place which is to be located."
            },
            {
              "content_md": "The lines of longitude, as stated earlier, are also known as the **‘Meridians’**. At a particular moment of time, if it is 12 Noon at a given longitude, it must be 12 Noon at all places on this longitude.\n\nThe **Earth makes a complete circle** on its axis—it covers **360° longitudes in 24 hours**. That is to say, it covers every **15° longitudes in one hour** or **1° longitude every 4 minutes**. Thus, if it is 12 Noon at 0° longitude, it must be 4 minutes past 12 Noon towards the east at the next 1°E longitude or at 15°E longitude it must be 1 p.m. Towards the west, it will be 1 hour less because the Earth rotates from West to East as the sun first rises in the East. For the purpose of memorising, **EGA-WLS formula** is used. **EGA** stands for **East-Gain-Add** and **WLS** means **West-Lose-Subtract**. This in other words means that for each 1° longitude towards the **East, 4 minutes are to be added** and each 1° longitude towards the **West, 4 minutes are to be subtracted**."
            },
            {
              "content_md": "### Eastern and Western Hemisphere\nThe **Prime Meridian**, together with the **180° longitude** usually divides the earth into the **Eastern and Western Hemispheres**. This division holds good practically for all purposes. However, any two diametrically opposite lines can also divide the earth into two equal hemispheres."
            }
          ]
        },
        {
          "title": "Great Circles and their use.",
          "sequence_number": 4,
          "depth": 1,
          "level_label": "Topic",
          "children": [],
          "content_blocks": [
            {
              "content_md": "A **great circle** is a circle that is drawn on the surface of a **sphere** (such as the earth) that has a radius equal to the radius of the **sphere**, and whose centre is also the sphere's centre. The **Equator** is the only latitude that is a **great circle**. All **longitudes** are a part of a **great circle**.\n\nCircles which do not pass through the centre of the earth are the **small circles**. All the **parallels of latitudes** other than the Equator are **small circles**. **Arcs of great circles** are the shortest route between two points on a sphere."
            }
          ]
        },
        {
          "title": "LINES OF LATITUDE",
          "sequence_number": 5,
          "depth": 1,
          "level_label": "Topic",
          "children": [],
          "content_blocks": [
            {
              "content_md": "- **Lines of Latitude** are the imaginary lines joining all places having the same latitude towards north or south of the **Equator**.\n- A **latitude** is the angular distance of a place north or south of the **Equator**.\n- A latitude is marked in **degrees**, with the **Equator** being 0 degrees.\n- **Latitudes** are calculated according to the angle a place makes with the centre of the earth.\n- Since the lines of latitude are parallel to the **Equator** and each other, they are called **parallels of latitude**.\n- Each parallel of latitude is a full circle. However, only the **Equator** is a **Great Circle**."
            },
            {
              "content_md": "[Image: Fig. 2.1. The Geographic Grid]"
            },
            {
              "content_md": "The **lines of latitude** are not of equal length and become smaller as we move towards the **poles**. At 60° latitude, in each hemisphere the length of the circle is half the length of the **Equator**. At the poles these lines are just points or dots."
            }
          ]
        },
        {
          "title": "Main Latitudes",
          "sequence_number": 6,
          "depth": 1,
          "level_label": "Topic",
          "children": [],
          "content_blocks": [
            {
              "content_md": "There are **181 parallels of latitude** at 1° interval."
            },
            {
              "content_md": "*   **Equator** is the longest line of latitude. It represents **0° latitude**.\n*   The **North Pole (90° N)** is located at an angular distance of 90° north of the Equator.\n*   The **South Pole** is located at an angular distance of 90° south of the Equator.\n*   The **Tropic of Cancer (23½°N)** is a line of latitude located 23½° north of the Equator.\n*   The **Tropic of Capricorn (23½°S)** is a line of latitude located 23½°S south of the Equator.\n*   The **Arctic Circle** represents **66½°N latitude**. The Arctic Circle marks the limit of the north polar region surrounding the North Pole.\n*   The **Antarctic Circle** represents **66½°S latitude**. The Antarctic Circle marks the limit of the south polar region around the South Pole."
            }
          ]
        },
        {
          "title": "Northern and Southern Hemisphere",
          "sequence_number": 7,
          "depth": 1,
          "level_label": "Topic",
          "children": [],
          "content_blocks": [
            {
              "content_md": "The **Equator** that runs midway between the poles divides the earth into two equal hemispheres known as the **Northern Hemisphere** and the **Southern Hemisphere**.\n\nThe Poles—**North Pole** and **South Pole**—are opposite to each other at the extreme ends of the sphere. They are each located at 90° angular distance north or south of the **Equator**."
            }
          ]
        },
        {
          "title": "Uses of Latitudes",
          "sequence_number": 8,
          "depth": 1,
          "level_label": "Topic",
          "children": [],
          "content_blocks": [
            {
              "content_md": "The lines of latitude form one of the coordinates of the **grid system**. The lines of latitude have the following uses:"
            },
            {
              "content_md": "**To find the location of a Place**: Latitudes give us the location of a place north or south of the **Equator**. Such a location is known as an **absolute location**.\n\n**To measure the distance of a Place**: Distances are calculated with reference to the **Equator** at right angle to the place. We can therefore, measure the distance of any place from the **Equator** based on its degree of latitude. For example, the latitude of Mumbai is 19°N and that of New Delhi is 30°N. We know that **1° latitude = 111 km**. We can say that Mumbai is 2109 km (111 × 19°) away from **Equator**. Similarly, New Delhi is 3,330 km (111 × 30°) away from **Equator**.\n\n**Heat Zones**: Besides helping us to locate places on maps and charts, lines of latitude divide the earth into distinct **heat belts**. The lines of latitude indicate the general climate of the area by applying the principle of **heat zones** or **thermal zones** of the earth. Thus, latitudes enable us to divide the whole earth into different climatic zones."
            },
            {
              "content_md": "[Image: Fig. 2.3. Important Parallels of Latitudes]"
            },
            {
              "content_md": "*   **The Torrid or Tropical Zone**: The area lying between the **Tropic of Cancer (23½°N)** and **Tropic of Capricorn (23½°S)** mark the limits of the **Torrid** (meaning very hot) **Zone**. It is also called the **Tropical Zone**. It is the hottest zone of the earth.\n*   **The Temperate Zones**: Two other important lines of latitude based on temperature are the **Arctic Circle (66½°N)** and the **Antarctic Circle (66½°S)**. Between the **Arctic Circle** and the **Tropic of Cancer** as well as between the **Antarctic Circle** and the **Tropic of Capricorn** lie the two **Temperate Zones** — the **North Temperate (23½°N to 66½°N)** and the **South Temperate zones (23½°S to 66½°S)**. In this region, the climate is moderate, i.e., neither too hot nor too cold.\n*   **The Frigid Zones**: Between the **Arctic Circle** and the **North Pole** and between the **Antarctic Circle** and the **South Pole** are the two **Frigid Zones** of the earth. These are the polar regions and receive the sun's slanting rays. In these two zones, very low temperatures are recorded."
            }
          ]
        },
        {
          "title": "Heat Zones:",
          "sequence_number": 9,
          "depth": 1,
          "level_label": "Topic",
          "children": [],
          "content_blocks": [
            {
              "content_md": "Besides helping to locate places on maps and charts, lines of latitude divide the earth into distinct **heat belts**. The lines of latitude indicate the general climate of the area by applying the principle of **heat zones** or **thermal zones** of the earth. Thus, latitudes enable the division of the whole earth into different **climatic zones**."
            }
          ]
        },
        {
          "title": "LINES OF LONGITUDE",
          "sequence_number": 10,
          "depth": 1,
          "level_label": "Topic",
          "children": [],
          "content_blocks": [
            {
              "content_md": "A **longitude** is the angular distance of a place east or west of the **Prime Meridian**.\n\nThe **Prime Meridian** is the line of longitude whose angular distance is defined as 0°. It passes through Greenwich near London.\n\n*   The lines to the west of Greenwich are suffixed with 'W' and those east of Greenwich are suffixed with 'E'. For example 60°W and 60°E.\n*   There are a total of 360 lines at 1° interval.\n*   The lines of longitude are also called **Meridians of Longitude**.\n\n**Meridians of Longitude**\n\n'**Meridian**' is derived from the Latin word 'meridianum' meaning noon. The sun crosses a meridian at noon. All places on a particular meridian will have noon at the same time.\n\n*   All meridians of longitude converge at the poles and are thus of equal length.\n*   The **Prime Meridian** is numbered as 0°. The others are numbered between 0° to 180°E or W. The line 180°E and W refer to the same meridian. It is diametrically opposite to the 0° longitude. Thus 0° and 180° meridian together make a full circle round the earth. Proceeding at 1° interval from both East and West, other full circles will be 1°– 179°, 2°– 178°, 60°– 120° and so on. Of the two lines in any segment, one will be in the east and the other in the west. The sum total of two lines will always be 180°. Individually all lines of longitude are semicircles.\n*   The two diametrically opposite lines make a full circle also known as the **Great Circle**.\n*   The distance between two lines of longitude is maximum at the **Equator** (111 km). The distance decreases gradually as one moves towards the poles.\n\n[Image: Fig. 2.4. Lines of Longitude]"
            }
          ]
        },
        {
          "title": "LONGITUDE AND TIME",
          "sequence_number": 11,
          "depth": 1,
          "level_label": "Topic",
          "children": [],
          "content_blocks": [
            {
              "content_md": "The lines of longitude, as stated earlier, are also known as the **'Meridians'**. At a particular moment of time, if it is 12 Noon at a given longitude, it must be 12 Noon at all places on this longitude."
            },
            {
              "content_md": "The Earth makes a complete circle on its axis—it covers **360° longitudes in 24 hours**. That is to say, it covers every **15° longitudes in one hour** or **1° longitude every 4 minutes**. Thus, if it is 12 Noon at 0° longitude, it must be 4 minutes past 12 Noon towards the east at the next 1°E longitude or at 15°E longitude it must be 1 p.m. Towards the west, it will be 1 hour less because the **Earth rotates from West to East** as the sun first rises in the East. For the purpose of memorising, the **EGA-WLS formula** is used. **EGA** stands for **East-Gain-Add** and **WLS** means **West-Lose-Subtract**. This in other words means that for each 1° longitude towards the **East**, 4 minutes are to be **added** and each 1° longitude towards the **West**, 4 minutes are to be **subtracted**."
            },
            {
              "content_md": "### Eastern and Western Hemisphere\nThe **Prime Meridian**, together with the **180° longitude** usually divides the earth into the **Eastern and Western Hemispheres**. This division holds good practically for all purposes. However, any two diametrically opposite lines can also divide the earth into two equal hemispheres."
            }
          ]
        },
        {
          "title": "Eastern and Western Hemisphere",
          "sequence_number": 12,
          "depth": 1,
          "level_label": "Topic",
          "children": [],
          "content_blocks": [
            {
              "content_md": "The **Prime Meridian**, together with the **180° longitude** usually divides the earth into the **Eastern and Western Hemispheres**. This division holds good practically for all purposes. However, any two diametrically opposite lines can also divide the earth into two equal hemispheres."
            }
          ]
        },
        {
          "title": "LOCAL TIME",
          "sequence_number": 13,
          "depth": 1,
          "level_label": "Topic",
          "children": [],
          "content_blocks": [
            {
              "content_md": "The **local time** of any place is obtained by the **overhead sun at noon**. For each degree of longitude, the local time varies by **4 minutes**. For example, the longitude of Mumbai is 73°E and that of New Delhi is 77°E. If it is 12 Noon at Mumbai (73°E) it must be 16 minutes past 12 Noon at New Delhi at the same time (77°E – 73°E = 4° longitude difference. 1° longitude = 4 minutes 4° longitude = 16 minutes which is to be added because Delhi lies to the east of Mumbai). This means that there will be a huge time difference between Gujarat in the west and Assam in the east. Every place at a different longitude will have its own local time."
            }
          ]
        },
        {
          "title": "TIME ZONES AND STANDARD TIME",
          "sequence_number": 14,
          "depth": 1,
          "level_label": "Topic",
          "children": [],
          "content_blocks": [
            {
              "content_md": ""
            }
          ]
        },
        {
          "title": "Indian Standard Time (IST)",
          "sequence_number": 15,
          "depth": 1,
          "level_label": "Topic",
          "children": [],
          "content_blocks": [
            {
              "content_md": "In India, **82°30'E** is the **central meridian**. It passes through **Mirzapur** near **Allahabad (Prayagraj)**. It is known as the **Standard Meridian of India**. While fixing the **Indian Standard Time (IST)** with respect to the **Greenwich Mean Time (GMT)**, 330 minutes or 5½ hours must be added (82°30' x 4 minutes). This means that India is **5½ hours ahead of GMT**. Thus, if it is 9 AM at London, it must be 9 + 5.30 or 14.30 hrs or 2.30 PM in India."
            }
          ]
        },
        {
          "title": "INTERNATIONAL DATE LINE",
          "sequence_number": 16,
          "depth": 1,
          "level_label": "Topic",
          "children": [],
          "content_blocks": [
            {
              "content_md": "The line of longitude **180°** is one and the same for East or West of the **Prime Meridian**. Since it is diametrically opposite to the **Greenwich Meridian** it causes a time difference of a full day on crossing the line. The time difference works out to 12 hours (180° × 4 min) from either side. Thus, on crossing the line, a **day is gained or lost**. When crossing from the east, time will be 12 hours ahead and while crossing from the west time will be 12 hours behind. If it is 8 PM Monday, 25th December at Greenwich, it will be 8 AM Tuesday, 26th December on crossing the 180° line. But if one were to travel from the west, it will be 12 hours behind or 8 AM Monday, 25th December. When the time lost and gained is computed together, the difference works out to full 24 hours at 180°E and W. (In the above example, the difference between 8 AM Monday 25th December and 8 AM Tuesday 26th December is 24 hours).\n\nThe **International Date Line (IDL)** is the **180° line**. When crossing this date line the date changes. \n\n[Image: Fig. 2.6. The International Date Line]\n\nThe boat 1 on the left is sailing to the right, that is eastwards. When crossing the International Date Line Sunday becomes Monday, so that a day is lost. When the boat 2 on the right (which is sailing westwards) crosses the International Date Line Monday becomes Sunday, so that a day is gained.\n\nTo avoid the confusion of having different dates within the same country, the Date Line **bends and goes zig-zag** at the **Bering Strait** between Siberia and Alaska and at **Fiji, Tonga, New Zealand** and some other islands."
            }
          ]
        },
        {
          "title": "LOCATING PLACES",
          "sequence_number": 17,
          "depth": 1,
          "level_label": "Topic",
          "children": [],
          "content_blocks": [
            {
              "content_md": "With the help of the **grid**, places can be located on the globe or the map, if the **latitude** and **longitude** of those places are known."
            }
          ]
        },
        {
          "title": "GREAT AND SMALL CIRCLES",
          "sequence_number": 18,
          "depth": 1,
          "level_label": "Topic",
          "children": [],
          "content_blocks": [
            {
              "content_md": "A **great circle** is a circle that is drawn on the surface of a **sphere** (such as the earth) that has a radius equal to the radius of the sphere, and whose centre is also the sphere's centre. The **Equator** is the only latitude that is a great circle. All **longitudes** are a part of a great circle.\n\nCircles which do not pass through the centre of the earth are the **small circles**. All the **parallels of latitudes** other than the Equator are small circles. **Arcs of great circles** are the shortest route between two points on a sphere."
            }
          ]
        },
        {
          "title": "Uses of Great Circles",
          "sequence_number": 19,
          "depth": 1,
          "level_label": "Topic",
          "children": [],
          "content_blocks": [
            {
              "content_md": "(i) **Navigators** use **great circles** to find the **shortest distance** between any two points on the earth's surface. A **Great Circle Route** is the shortest distance between two places on the earth and lies on the **arc of a great circle**. Using this hypothesis, the shortest route from New York to Moscow would be over the North Pole. Thus, it does not take into account restrictions such as weather or political restrictions imposed by the countries concerned. It also does not take into account, lack of landing and take off facilities for aeroplanes.\n(ii) **Great Circle routes** are specially important for places that are on opposite sides of the globe. Most globes show great circle routes between distant ports across the Atlantic, the Pacific and the Indian Ocean.\n(iii) **Great circles** are used by **meteorologists** to determine climate and weather conditions in a region."
            }
          ]
        }
      ],
      "content_blocks": []
    }
  ],
  "additional_sections": [
    {
      "title": "Difference between Lines of Latitude and Lines of Longitude",
      "content_md": "| Latitude | Longitude |\n| :--- | :--- |\n| 1. A latitude is the angular distance of a place north or south of the Equator. | 1. A longitude is the angular distance of a place east or west of the Prime Meridian. |\n| 2. Lines of Latitude are parallel to the Equator and each other. | 2. All meridians of longitude converge at the poles. |\n| 3. Each parallel of latitude is a full circle. The lines of latitude are not of equal length and become smaller on moving towards the poles. | 3. Individually all lines of longitude are semicircles and of equal length. |\n| 4. Latitude degrees are measured from the Equator to its north or south. | 4. Longitude degrees are measured from the Prime meridian to its east or west. |\n| 5. The distance between two lines of latitude is approximately 111 km. | 5. The distance between two lines of longitude is maximum at the Equator, i.e., 111 km, but it goes on decreasing on moving towards the poles. It is 0° at the poles. |\n| 6. Lines of latitude are used to find the location of a place, to measure the distance of a place and to divide the whole earth into different heat or climatic zones. | 6. Lines of longitude are used to find the local and standard time of a place. Along with the lines of latitude, the longitudes are used to locate places on the globe or a map. |"
    },
    {
      "title": "Time Zones",
      "content_md": "To overcome the confusion while allowing the interplay of natural forces to operate, the earth has been divided into 24 Time Zones according to the number of hours in a day. Each zone covers 15° longitude (360 ÷ 24). The time for the whole zone is determined on the basis of the central meridian of that place. While countries with smaller east-west extent like India have only one Standard Time Zone, countries like Russia, Canada, USA have more than one Time Zones."
    },
    {
      "title": "Standard Time",
      "content_md": "The uniform time based on a central meridian is known as the Standard Time. Standard time must always be divisible by 7½°. This allows time to be reckoned by a unit of half-an-hour and not smaller differences."
    },
    {
      "title": "Greenwich Mean Time",
      "content_md": "Further, while fixing the Time Zones, the time at Greenwich (0° longitude) has been selected as the mean time. Thus, if it is 12 Noon at Greenwich, at 15°E longitude, the time will be 1 pm and at 30°E longitude, the time will be 2 pm. The time fixed with reference to Greenwich is called the Greenwich Mean Time or GMT."
    },
    {
      "title": "Worked Out Example for calculating the Time at a place",
      "content_md": "**Example:** It is 5.30 p.m. in India when the Prime Minister's radio broadcast made from Montreal in Canada was heard. What must have been the time at Montreal?\n\n**Solution 1:** After consulting the atlas we find Montreal lies 74°W.\nTime in India = 1730 hrs (5:30 PM)\n∴ India is ahead of GMT = 5 hrs 30 m\n∴ Time at Greenwich = 1200 hrs. (noon)\n∴ Montreal Time difference with respect to GMT\n= 296 min. (74 × 4 min.)\n= 4 hours 56 minutes\nMontreal is to the west of GMT, its time\n= 12 hrs - 4 hours 56 min.\n= 7:04 a.m.\n\n**Solution 2:** Standard Meridian of India = 82½°E\nStandard Meridian of Montreal = 74°W\nTotal meridians = 156½°\nMeridian = 4 minutes\n156½° meridian = 626 minutes (156½° × 4)\n= 10 hrs 26 minutes\nMontreal is to the west of Delhi, therefore, time difference will be deducted = 1730 hrs - 1026 hrs = 7.04 a.m. in Montreal.\n\n∴ The Prime Minister made his broadcast at 7.04 AM from Montreal which was received at 5.30 p.m. in India."
    },
    {
      "title": "Worked Out Examples",
      "content_md": "The latitude and longitude of three places is given below. Pinpoint these places on the globe.\n(i) New York – Latitude 41°N and Longitude 74°W\n(ii) New Delhi – 30°N and 77°E\n(iii) Mumbai – 19°N and 73°E\n\nFirst look at the data of New York. It is a common practice to write first the latitude and then the longitude of a place. For locating the above, identify the relevant latitudes and longitudes. Where the two lines meet, or the point at which they cross each other, lies the place which is to be located."
    },
    {
      "title": "Characteristics of a Great Circle",
      "content_md": "(i) A great circle is a theoretical circle formed by the intersection of the earth's surface and an imaginary plane that passes through the centre of the earth and divides it into two equal parts.\n(ii) All such circles must pass through or touch the centre of the circle.\n(iii) Infinite number of circles that touch the two opposite ends of the sphere can be drawn on a sphere.\n(iv) Intersecting great circles always bisect each other."
    }
  ],
  "needs_review": [
    "TIME ZONES AND STANDARD TIME"
  ],
  "manifest": {
    "syllabus_leaves": [
      {
        "path": "Geographic Grid: Latitudes and Longitudes > Concept of latitudes: main latitudes, their location with degrees, parallels of latitude and their uses.",
        "path_titles": [
          "Geographic Grid: Latitudes and Longitudes",
          "Concept of latitudes: main latitudes, their location with degrees, parallels of latitude and their uses."
        ],
        "title": "Concept of latitudes: main latitudes, their location with degrees, parallels of latitude and their uses.",
        "sequence_number": 1,
        "depth": 1,
        "level_label": "Topic",
        "has_notes": true
      },
      {
        "path": "Geographic Grid: Latitudes and Longitudes > Concept of longitudes — Prime Meridian, time (local, standard and time zones, Greenwich Mean Time (GMT) and International Date Line (IDL). Eastern and Western hemisphere.",
        "path_titles": [
          "Geographic Grid: Latitudes and Longitudes",
          "Concept of longitudes — Prime Meridian, time (local, standard and time zones, Greenwich Mean Time (GMT) and International Date Line (IDL). Eastern and Western hemisphere."
        ],
        "title": "Concept of longitudes — Prime Meridian, time (local, standard and time zones, Greenwich Mean Time (GMT) and International Date Line (IDL). Eastern and Western hemisphere.",
        "sequence_number": 2,
        "depth": 1,
        "level_label": "Topic",
        "has_notes": true
      },
      {
        "path": "Geographic Grid: Latitudes and Longitudes > Using latitudes and longitudes to find location. Calculation of time.",
        "path_titles": [
          "Geographic Grid: Latitudes and Longitudes",
          "Using latitudes and longitudes to find location. Calculation of time."
        ],
        "title": "Using latitudes and longitudes to find location. Calculation of time.",
        "sequence_number": 3,
        "depth": 1,
        "level_label": "Topic",
        "has_notes": true
      },
      {
        "path": "Geographic Grid: Latitudes and Longitudes > Great Circles and their use.",
        "path_titles": [
          "Geographic Grid: Latitudes and Longitudes",
          "Great Circles and their use."
        ],
        "title": "Great Circles and their use.",
        "sequence_number": 4,
        "depth": 1,
        "level_label": "Topic",
        "has_notes": true
      },
      {
        "path": "Geographic Grid: Latitudes and Longitudes > LINES OF LATITUDE",
        "path_titles": [
          "Geographic Grid: Latitudes and Longitudes",
          "LINES OF LATITUDE"
        ],
        "title": "LINES OF LATITUDE",
        "sequence_number": 5,
        "depth": 1,
        "level_label": "Topic",
        "has_notes": true
      },
      {
        "path": "Geographic Grid: Latitudes and Longitudes > Main Latitudes",
        "path_titles": [
          "Geographic Grid: Latitudes and Longitudes",
          "Main Latitudes"
        ],
        "title": "Main Latitudes",
        "sequence_number": 6,
        "depth": 1,
        "level_label": "Topic",
        "has_notes": true
      },
      {
        "path": "Geographic Grid: Latitudes and Longitudes > Northern and Southern Hemisphere",
        "path_titles": [
          "Geographic Grid: Latitudes and Longitudes",
          "Northern and Southern Hemisphere"
        ],
        "title": "Northern and Southern Hemisphere",
        "sequence_number": 7,
        "depth": 1,
        "level_label": "Topic",
        "has_notes": true
      },
      {
        "path": "Geographic Grid: Latitudes and Longitudes > Uses of Latitudes",
        "path_titles": [
          "Geographic Grid: Latitudes and Longitudes",
          "Uses of Latitudes"
        ],
        "title": "Uses of Latitudes",
        "sequence_number": 8,
        "depth": 1,
        "level_label": "Topic",
        "has_notes": true
      },
      {
        "path": "Geographic Grid: Latitudes and Longitudes > Heat Zones:",
        "path_titles": [
          "Geographic Grid: Latitudes and Longitudes",
          "Heat Zones:"
        ],
        "title": "Heat Zones:",
        "sequence_number": 9,
        "depth": 1,
        "level_label": "Topic",
        "has_notes": true
      },
      {
        "path": "Geographic Grid: Latitudes and Longitudes > LINES OF LONGITUDE",
        "path_titles": [
          "Geographic Grid: Latitudes and Longitudes",
          "LINES OF LONGITUDE"
        ],
        "title": "LINES OF LONGITUDE",
        "sequence_number": 10,
        "depth": 1,
        "level_label": "Topic",
        "has_notes": true
      },
      {
        "path": "Geographic Grid: Latitudes and Longitudes > LONGITUDE AND TIME",
        "path_titles": [
          "Geographic Grid: Latitudes and Longitudes",
          "LONGITUDE AND TIME"
        ],
        "title": "LONGITUDE AND TIME",
        "sequence_number": 11,
        "depth": 1,
        "level_label": "Topic",
        "has_notes": true
      },
      {
        "path": "Geographic Grid: Latitudes and Longitudes > Eastern and Western Hemisphere",
        "path_titles": [
          "Geographic Grid: Latitudes and Longitudes",
          "Eastern and Western Hemisphere"
        ],
        "title": "Eastern and Western Hemisphere",
        "sequence_number": 12,
        "depth": 1,
        "level_label": "Topic",
        "has_notes": true
      },
      {
        "path": "Geographic Grid: Latitudes and Longitudes > LOCAL TIME",
        "path_titles": [
          "Geographic Grid: Latitudes and Longitudes",
          "LOCAL TIME"
        ],
        "title": "LOCAL TIME",
        "sequence_number": 13,
        "depth": 1,
        "level_label": "Topic",
        "has_notes": true
      },
      {
        "path": "Geographic Grid: Latitudes and Longitudes > TIME ZONES AND STANDARD TIME",
        "path_titles": [
          "Geographic Grid: Latitudes and Longitudes",
          "TIME ZONES AND STANDARD TIME"
        ],
        "title": "TIME ZONES AND STANDARD TIME",
        "sequence_number": 14,
        "depth": 1,
        "level_label": "Topic",
        "has_notes": false
      },
      {
        "path": "Geographic Grid: Latitudes and Longitudes > Indian Standard Time (IST)",
        "path_titles": [
          "Geographic Grid: Latitudes and Longitudes",
          "Indian Standard Time (IST)"
        ],
        "title": "Indian Standard Time (IST)",
        "sequence_number": 15,
        "depth": 1,
        "level_label": "Topic",
        "has_notes": true
      },
      {
        "path": "Geographic Grid: Latitudes and Longitudes > INTERNATIONAL DATE LINE",
        "path_titles": [
          "Geographic Grid: Latitudes and Longitudes",
          "INTERNATIONAL DATE LINE"
        ],
        "title": "INTERNATIONAL DATE LINE",
        "sequence_number": 16,
        "depth": 1,
        "level_label": "Topic",
        "has_notes": true
      },
      {
        "path": "Geographic Grid: Latitudes and Longitudes > LOCATING PLACES",
        "path_titles": [
          "Geographic Grid: Latitudes and Longitudes",
          "LOCATING PLACES"
        ],
        "title": "LOCATING PLACES",
        "sequence_number": 17,
        "depth": 1,
        "level_label": "Topic",
        "has_notes": true
      },
      {
        "path": "Geographic Grid: Latitudes and Longitudes > GREAT AND SMALL CIRCLES",
        "path_titles": [
          "Geographic Grid: Latitudes and Longitudes",
          "GREAT AND SMALL CIRCLES"
        ],
        "title": "GREAT AND SMALL CIRCLES",
        "sequence_number": 18,
        "depth": 1,
        "level_label": "Topic",
        "has_notes": true
      },
      {
        "path": "Geographic Grid: Latitudes and Longitudes > Uses of Great Circles",
        "path_titles": [
          "Geographic Grid: Latitudes and Longitudes",
          "Uses of Great Circles"
        ],
        "title": "Uses of Great Circles",
        "sequence_number": 19,
        "depth": 1,
        "level_label": "Topic",
        "has_notes": true
      }
    ],
    "stray_leaves": [
      {
        "title": "Difference between Lines of Latitude and Lines of Longitude",
        "insert_after_index": 11,
        "micro_topics": [],
        "has_notes": true
      },
      {
        "title": "Time Zones",
        "insert_after_index": 14,
        "micro_topics": [],
        "has_notes": true
      },
      {
        "title": "Standard Time",
        "insert_after_index": 14,
        "micro_topics": [],
        "has_notes": true
      },
      {
        "title": "Greenwich Mean Time",
        "insert_after_index": 14,
        "micro_topics": [],
        "has_notes": true
      },
      {
        "title": "Worked Out Example for calculating the Time at a place",
        "insert_after_index": 15,
        "micro_topics": [],
        "has_notes": true
      },
      {
        "title": "Worked Out Examples",
        "insert_after_index": 17,
        "micro_topics": [],
        "has_notes": true
      },
      {
        "title": "Characteristics of a Great Circle",
        "insert_after_index": 18,
        "micro_topics": [],
        "has_notes": true
      }
    ]
  }
}