{
  "board": "ICSE",
  "grade": 10,
  "subject": "HistoryCivics",
  "book_slug": "TotalHistoryCivics_MorningStar_DollyESequeira",
  "book_meta": {
    "book_name": "Total History & Civics",
    "publication": "Morning Star",
    "author": "Dolly E. Sequeira"
  },
  "chapter_sequence_number": 7,
  "chapter_title": "The Quit India Movement",
  "discipline": "history",
  "reconciliation": {
    "outline": [
      "EVENTS LEADING TO QUIT INDIA MOVEMENT",
      "Resignation of the Congress Ministries:",
      "August Offer (1940):",
      "The Cripps Mission (1942):",
      "Failure of the Cripps Mission:",
      "Japanese Threat:",
      "QUIT INDIA RESOLUTION",
      "The Quit India Movement",
      "Government's Repressive Measures",
      "The Significance of the Quit India Movement",
      "CHAPTER AT A GLANCE",
      "EXERCISES",
      "Multiple-Choice Questions",
      "Short Answer Questions",
      "Structured Questions",
      "Higher Order Thinking Skills (HOTS)"
    ],
    "in_syllabus_only": [
      "Causes (failure of the Cripps Mission (clauses will not be tested), Japanese threat)"
    ],
    "in_pdf_only": [
      {
        "title": "Resignation of the Congress Ministries:",
        "insert_after_index": -1,
        "micro_topics": []
      },
      {
        "title": "August Offer (1940):",
        "insert_after_index": -1,
        "micro_topics": []
      },
      {
        "title": "The Cripps Mission (1942):",
        "insert_after_index": -1,
        "micro_topics": []
      },
      {
        "title": "The Quit India Movement",
        "insert_after_index": 1,
        "micro_topics": []
      },
      {
        "title": "Government's Repressive Measures",
        "insert_after_index": 1,
        "micro_topics": []
      }
    ],
    "additional_sections": [
      {
        "title": "Resignation of the Congress Ministries:",
        "content_md": "The Second World War broke out in September 1939 when Nazi Germany invaded Poland. Britain and France went to Poland's aid and declared war on Germany. The British Government of India immediately joined the War without consulting the National Congress or the elected members of the Central Legislature.\n\nThe Congress leaders asked how it was possible for an enslaved nation to aid others in their fight for freedom. They, therefore, demanded that India must be declared free or at least have effective power before it could actively participate in the War. Lord Linlithgow, the Viceroy, could not give any such assurance. He declared Dominion Status as the goal of British Policy in India. This was considered inadequate by the Congress.\n\nThe British government tried to pit the religious minorities and Princes against the Congress. The Congress, therefore, asked its ministries to resign.\n\nIn July 1937, the Congress had formed ministries in the United Provinces, Central Provinces, Orissa, Bihar, Madras and Bombay. Later, Assam and the North-West Frontier also came under the Congress rule. The resignation of the Congress ministries in October-November 1939 had many implications.\n\n(i) The Viceroy was happy because the Congress ministries had controlled several provinces.\n(ii) The ministries in Punjab, Bengal and Sind did not resign to win the government's goodwill.\n(iii) The Muslim League was jubilant over the resignation of Congress Ministries and offered its friendship to the British Government. It celebrated the day when the Congress ministries resigned as a 'day of deliverance' and 'thanks-giving.'\n\nA change came in the attitude of the Muslim League and Jinnah after the elections of 1937 and formation of the Congress Ministries in the Provinces. Jinnah and other leaders of the League proclaimed that Muslims could not expect any justice at the hands of the Congress.\n\nIn 1940, the Muslim League passed a resolution demanding the partition of the country and the creation of a State called Pakistan. The name Pakistan was derived from the letters of the provinces and communities that the new country would comprise: Punjab, Afghan (North-West Frontier Province), Kashmir, Sind and Baluchistan. Jinnah proclaimed that the division of India into two autonomous States was the only solution to the Indian problem.\n\n[Image: Jinnah with Gandhiji]"
      },
      {
        "title": "August Offer (1940):",
        "content_md": "A change of government took place in Britain in May 1940. Winston Churchill became Prime Minister and L.S. Amery took over as the Secretary of State for India. The War situation in Europe worsened. The fall of France and the danger of Nazi occupation of Britain temporarily softened the hard stance of Congress. On June 1, 1940, Gandhiji declared: 'We do not seek our independence out of British ruin.'\n\nThe international compulsions forced the British Government and the British Indian Government to seek some settlement or understanding with the Congress. On August 8, 1940 (on the eve of the Battle of Britain), Lord Linlithgow, the Viceroy, made a new offer known as the 'August Offer'. The Congress rejected the offer because the minorities especially the Muslim League were assured that no constitutional scheme would be acceptable to the government unless and until it was agreed to by the minorities. The Muslim League did not accept the offer, as it did not give a clear assurance for the establishment of Pakistan."
      },
      {
        "title": "The Cripps Mission (1942):",
        "content_md": "With the Japanese army rapidly advancing towards India, it became necessary for the British to break the political deadlock in India. Churchill announced in March 1942, that Sir Stafford Cripps, a member of the War Cabinet, would go to India for consultation with all the parties. The Cripps Mission proposed the following Constitutional reforms:\n\n[Image: Cripps with Gandhiji]\n\n(i) India would be given a Dominion Status when the War would end. This Dominion would have the freedom to remain with the British Commonwealth or to secede from it.\n(ii) A Constituent Assembly would be set up. It would consist of the members elected by the Lower House of the Indian Legislature and the representatives of the Princely States nominated by their rulers. It would be set up to draft a new Constitution.\n(iii) There would be a federation of British India and Indian States. Any province that was not prepared to accept the Constitution would be allowed to obtain Dominion Status separately.\n(iv) The Provinces would be free to join the Indian Union. If they would not join the Indian federation, they would formulate their own Constitutions which could have the same status as the Union of India.\n(v) An undertaking would be negotiated between His Majesty's Government and the Constituent Assembly covering all matters arising out of the complete transfer of responsibilities.\n(vi) Provisions would also be made for the protection of the racial and religious minorities.\n(vii) During the critical years of the War, the power of the Viceroy would remain as hitherto and he would be responsible for the defence of the country. But the task of organising the military and material resources of India would be the responsibility of the Government of India with the cooperation of the people of India."
      },
      {
        "title": "The Quit India Movement",
        "content_md": "The All-India Congress Committee met at Bombay on August 8, 1942 and passed the Quit India Resolution adopted at Wardha in July 1942. The Congress proposed to start a non-violent mass struggle under Gandhiji's leadership if this demand of immediate and complete independence was not conceded by the British. In his speech before the All India Congress Committee, Gandhiji declared that it was a decision \"To Do or Die\".\n\nBefore the Congress could start the movement, the Government struck hard. Early in the morning of August 9, Gandhiji and other Congress leaders were arrested and taken to unknown destinations and the Congress was once again declared illegal.\n\nAll over the country there were strikes and demonstrations which were lathi-charged and fired upon. People attacked the symbols of British authority—the police stations, post offices, railway stations, etc. National flags were hoisted on public buildings in defiance of the police. British authority disappeared in parts of Uttar Pradesh, Bihar, West Bengal, Odisha, Andhra Pradesh, Tamil Nadu and Maharashtra. In some areas such as Ballia in Eastern U.P., Tamluk in Midnapore district of West Bengal and Satara district of Maharashtra, the nationalists set up parallel governments.\n\nAchyutrao Patwardhan, Jai Prakash Narayan, Ram Manohar Lohia, Aruna Asaf Ali and Nana Patil were among the prominent leaders of the underground movement. They set up a Central Directorate at Mumbai. They kept the movement alive despite the government's repressive measures.\n\nThe movement also saw the active participation of women such as Matangini Hazra in Bengal, Kanaklata Barua in Assam and Rama Devi in Odisha. Aruna Asaf Ali hoisted the Indian National flag at the Gowalia Tank ground, now popularly known as August Kranti Maidan, Mumbai on August 9, 1942. She, along with Usha Mehta, also broadcasted news through an underground radio station."
      },
      {
        "title": "Government's Repressive Measures",
        "content_md": "The government resorted to severe measures to crush the 1942 Movement. The Press was completely muzzled. The demonstrating crowds were machine-gunned and even bombed from the air. Prisoners were tortured. The police and secret police reigned supreme. Nearly ten thousand people were killed and 60,000 people were arrested by the end of 1942.\n\nThe military took over many towns and cities. Rebellious villages had to pay huge sums as punitive fines and the villagers had to undergo mass floggings. India had not witnessed such intense repression since the First War of Independence, 1857.\n\nGandhiji was detained at the Agha Khan Palace in Pune; the other leaders were sent to jail in Ahmednagar Fort. In the end, the government succeeded in crushing the movement."
      }
    ]
  },
  "nodes": [
    {
      "title": "The Quit India Movement",
      "sequence_number": 1,
      "depth": 0,
      "level_label": "Section",
      "children": [
        {
          "title": "Causes (failure of the Cripps Mission (clauses will not be tested), Japanese threat), Quit India Resolution and the significance of the Movement.",
          "sequence_number": 1,
          "depth": 1,
          "level_label": "Topic",
          "children": [],
          "content_blocks": [
            {
              "content_md": "### Causes of the Quit India Movement\n\n**Failure of the Cripps Mission:** Almost all the parties and sections of the people rejected the proposals on the following grounds:\n\n1.  The Cripps Mission did not bring with it the promise of **independence in the near future**.\n2.  The plan involved **partitioning the country**.\n3.  The **League** opposed the creation of a single union. The proposals did not accept Pakistan specifically. They did not grant the right of self-determination to Muslims.\n4.  The **Hindu Mahasabha** rejected the proposals because it feared the partition of the country.\n5.  The **Sikhs**, the **Anglo-Indians**, the **Indian Christians** and **labour leaders** also opposed them because they did not provide sufficient safeguards for their interests.\n6.  The people of the **Princely States** had no right to send their representatives to the proposed Constitution-making body. Their representatives were to be selected by the rulers.\n7.  The **Congress** was opposed to the principle of non-accession of the provinces. Gandhiji opposed the Declaration and urged the Working Committee to reject it. Mahatma Gandhi described the Cripps proposals as a **'post-dated cheque on a failing bank.'**\n8.  The Congress wanted that all Subjects, including **Defence** should be handed over to the National Government. The Congress insisted on the immediate formation of a National Government with full responsibility.\n\n**Japanese Threat:** The War situation was discouraging in 1942. The Japanese Army had attacked Burma (Myanmar) and was marching towards Assam. Gandhiji observed, **'The presence of British in India is an invitation to Japan to invade India. Their withdrawal removes the bait.'** The Indian leaders were anxious to save their country from the Japanese invasion but their slavery was a hindrance. Gandhiji and other leaders were convinced that this situation called for complete independence from the British immediately. Gandhiji said, **'India's safety, and Britain's too, lies in the orderly and timely British withdrawal from India'**. So they decided to launch a movement calling upon the British to quit India."
            },
            {
              "content_md": "### Quit India Resolution\n\nIn 1942, the failure of the Cripps Mission left no further meeting ground between the British Government and the Congress. Mahatma Gandhi felt that the British presence in India was an invitation to Japan to invade India and that their withdrawal would remove the bait. He therefore, asked the British \"to leave India in God's hands.\"\n\nThe **Congress Working Committee** met at **Wardha** in **July, 1942**. It adopted a resolution, known as the **Quit India Resolution**. The resolution stated: **'British rule in India must end immediately.'**\n\nThe **All-India Congress Committee** met at **Bombay on August 8, 1942** and passed the Quit India Resolution adopted at Wardha in July 1942. The Congress proposed to start a non-violent mass struggle under Gandhiji's leadership if this demand of immediate and complete independence was not conceded by the British. In his speech before the All India Congress Committee, Gandhiji declared that it was a decision **\"To Do or Die\"**."
            },
            {
              "content_md": "### The Significance of the Quit India Movement\n\nThe Quit India movement made independence of India as the only agenda of the National Movement. It proved that there could be no retreat and future negotiations could only be on the manner of the transfer of power. The Movement had the following impact:\n\n1.  The Quit India Movement was in fact short-lived. Its importance lay in the fact that it demonstrated the depth that **nationalist feeling** had reached in the country and the great capacity for **struggle and sacrifice** that the people had developed.\n2.  It was evident that the British would no longer find it possible to rule India against the wishes of the people.\n3.  It was the **mass uprising** before attaining independence. People from all parts of India took part in processions and demonstrations. The Hindus, Muslims, Sikhs, Christians and Parsis and even people from the Princely States participated.\n4.  The Quit India Movement strengthened the **Congress Socialist Party** because of its heroic role in the movement. Its leader **Jai Prakash Narayan** became a legendary figure. The Party continued its underground movement till 1944 when it came to an end.\n5.  After the suppression of the Quit India Movement, the Constitutional question remained dormant till the close of the War in 1945.\n6.  After the suppression of the Quit India Movement of 1942, there was hardly any political activity inside the country till the War ended in 1945. The leaders of the National Movement were in jail, and no new leaders arose to take their place to give a new lead to the country.\n\nHenceforth, the battle for the freedom of India was carried on beyond the country's frontiers. It was led by the **Indian National Army** and its chief, **Subhas Chandra Bose**."
            }
          ]
        }
      ],
      "content_blocks": []
    },
    {
      "title": "EVENTS LEADING TO QUIT INDIA MOVEMENT",
      "sequence_number": 2,
      "depth": 0,
      "level_label": "Section",
      "children": [
        {
          "title": "Resignation of the Congress Ministries:",
          "sequence_number": 1,
          "depth": 1,
          "level_label": "Topic",
          "children": [],
          "content_blocks": [
            {
              "content_md": "The **Second World War** broke out in **September 1939** when Nazi Germany invaded Poland. Britain and France went to Poland's aid and declared war on Germany. The British Government of India immediately joined the War without consulting the National Congress or the elected members of the Central Legislature.\n\nThe Congress leaders asked how it was possible for an enslaved nation to aid others in their fight for freedom. They, therefore, demanded that India must be declared free or at least have effective power before it could actively participate in the War. **Lord Linlithgow**, the Viceroy, could not give any such assurance. He declared **Dominion Status** as the goal of British Policy in India. This was considered inadequate by the Congress.\n\nThe British government tried to pit the religious minorities and Princes against the Congress. The Congress, therefore, asked its ministries to resign."
            },
            {
              "content_md": "In **July 1937**, the Congress had formed ministries in the United Provinces, Central Provinces, Orissa, Bihar, Madras and Bombay. Later, Assam and the North-West Frontier also came under the Congress rule. The resignation of the Congress ministries in **October-November 1939** had many implications.\n\n(i) The Viceroy was happy because the Congress ministries had controlled several provinces.\n(ii) The ministries in Punjab, Bengal and Sind did not resign to win the government's goodwill.\n(iii) The **Muslim League** was jubilant over the resignation of Congress Ministries and offered its friendship to the British Government. It celebrated the day when the Congress ministries resigned as a **'day of deliverance'** and **'thanks-giving.'**"
            },
            {
              "content_md": "[Image: Jinnah with Gandhiji]\n\nA change came in the attitude of the **Muslim League** and **Jinnah** after the elections of 1937 and formation of the Congress Ministries in the Provinces. Jinnah and other leaders of the League proclaimed that Muslims could not expect any justice at the hands of the Congress.\n\nIn **1940**, the **Muslim League** passed a resolution demanding the **partition of the country** and the creation of a State called **Pakistan**. The name Pakistan was derived from the letters of the provinces and communities that the new country would comprise: **Punjab, Afghan** (North-West Frontier Province), **Kashmir, Sind** and **Baluchistan**. Jinnah proclaimed that the division of India into two autonomous States was the only solution to the Indian problem."
            }
          ]
        },
        {
          "title": "August Offer (1940):",
          "sequence_number": 2,
          "depth": 1,
          "level_label": "Topic",
          "children": [],
          "content_blocks": [
            {
              "content_md": "A change of government took place in Britain in **May 1940**. **Winston Churchill** became Prime Minister and **L.S. Amery** took over as the Secretary of State for India. The War situation in Europe worsened. The fall of France and the danger of Nazi occupation of Britain temporarily softened the hard stance of **Congress**. On **June 1, 1940**, **Gandhiji** declared: 'We do not seek our independence out of British ruin.'\n\nThe international compulsions forced the British Government and the British Indian Government to seek some settlement or understanding with the **Congress**. On **August 8, 1940** (on the eve of the Battle of Britain), **Lord Linlithgow**, the Viceroy, made a new offer known as the **‘August Offer’**. The **Congress** rejected the offer because the minorities especially the **Muslim League** were assured that no constitutional scheme would be acceptable to the government unless and until it was agreed to by the minorities. The **Muslim League** did not accept the offer, as it did not give a clear assurance for the establishment of **Pakistan**."
            }
          ]
        },
        {
          "title": "The Cripps Mission (1942):",
          "sequence_number": 3,
          "depth": 1,
          "level_label": "Topic",
          "children": [],
          "content_blocks": [
            {
              "content_md": "With the Japanese army rapidly advancing towards India, it became necessary for the British to break the political deadlock in India. **Winston Churchill** announced in **March 1942**, that **Sir Stafford Cripps**, a member of the **War Cabinet**, would go to India for consultation with all the parties.\n\n[Image: Cripps with Gandhiji]\n\nThe **Cripps Mission** proposed the following **Constitutional reforms**:"
            },
            {
              "content_md": "1. India would be given a **Dominion Status** when the War would end. This Dominion would have the freedom to remain with the **British Commonwealth** or to secede from it.\n2. A **Constituent Assembly** would be set up. It would consist of the members elected by the **Lower House of the Indian Legislature** and the representatives of the **Princely States** nominated by their rulers. It would be set up to draft a new Constitution.\n3. There would be a federation of **British India** and **Indian States**. Any province that was not prepared to accept the Constitution would be allowed to obtain **Dominion Status** separately.\n4. The Provinces would be free to join the **Indian Union**. If they would not join the Indian federation, they would formulate their own Constitutions which could have the same status as the Union of India.\n5. An undertaking would be negotiated between His Majesty's Government and the **Constituent Assembly** covering all matters arising out of the complete transfer of responsibilities.\n6. Provisions would also be made for the protection of the racial and religious minorities.\n7. During the critical years of the War, the power of the **Viceroy** would remain as hitherto and he would be responsible for the defence of the country. But the task of organising the military and material resources of India would be the responsibility of the Government of India with the cooperation of the people of India."
            }
          ]
        },
        {
          "title": "Failure of the Cripps Mission:",
          "sequence_number": 4,
          "depth": 1,
          "level_label": "Topic",
          "children": [],
          "content_blocks": [
            {
              "content_md": "Almost all the parties and sections of the people rejected the proposals on the following grounds:\n\n1.  The **Cripps Mission** did not bring with it the promise of **independence** in the near future.\n2.  The plan involved **partitioning the country**.\n3.  The **League** opposed the creation of a single union. The proposals did not accept **Pakistan** specifically. They did not grant the **right of self-determination to Muslims**.\n4.  The **Hindu Mahasabha** rejected the proposals because it feared the partition of the country.\n5.  The **Sikhs**, the **Anglo-Indians**, the **Indian Christians** and **labour leaders** also opposed them because they did not provide sufficient safeguards for their interests.\n6.  The people of the **Princely States** had no right to send their representatives to the proposed **Constitution-making body**. Their representatives were to be selected by the rulers.\n7.  The **Congress** was opposed to the principle of **non-accession of the provinces**. **Gandhiji** opposed the Declaration and urged the Working Committee to reject it. Mahatma Gandhi described the Cripps proposals as a **'post-dated cheque on a failing bank.'**\n8.  The **Congress** wanted that all Subjects, including **Defence** should be handed over to the **National Government**. The Congress insisted on the immediate formation of a National Government with full responsibility."
            }
          ]
        },
        {
          "title": "Japanese Threat:",
          "sequence_number": 5,
          "depth": 1,
          "level_label": "Topic",
          "children": [],
          "content_blocks": [
            {
              "content_md": "The War situation was discouraging in **1942**. The **Japanese Army** had attacked **Burma (Myanmar)** and was marching towards **Assam**. **Gandhiji** observed, 'The presence of British in India is an invitation to Japan to invade India. Their withdrawal removes the bait.' The Indian leaders were anxious to save their country from the Japanese invasion but their slavery was a hindrance. **Gandhiji** and other leaders were convinced that this situation called for **complete independence** from the British immediately. **Gandhiji** said, 'India's safety, and Britain's too, lies in the orderly and timely **British withdrawal from India**'. So they decided to launch a movement calling upon the British to quit India."
            }
          ]
        }
      ],
      "content_blocks": []
    },
    {
      "title": "QUIT INDIA RESOLUTION",
      "sequence_number": 3,
      "depth": 0,
      "level_label": "Section",
      "children": [],
      "content_blocks": [
        {
          "content_md": "In 1942, the failure of the **Cripps Mission** left no further meeting ground between the British Government and the Congress. **Mahatma Gandhi** felt that the British presence in India was an invitation to Japan to invade India and that their withdrawal would remove the bait. He therefore, asked the British \"to leave India in God's hands.\"\n\nThe **Congress Working Committee** met at **Wardha** in **July, 1942**. It adopted a resolution, known as the **Quit India Resolution**. The resolution stated: '**British rule in India must end immediately**.'"
        }
      ]
    },
    {
      "title": "The Quit India Movement",
      "sequence_number": 4,
      "depth": 0,
      "level_label": "Section",
      "children": [],
      "content_blocks": [
        {
          "content_md": "The **All-India Congress Committee** met at Bombay on **August 8, 1942** and passed the **Quit India Resolution** adopted at Wardha in July 1942. The Congress proposed to start a **non-violent mass struggle** under Gandhiji's leadership if this demand of immediate and complete independence was not conceded by the British. In his speech before the All India Congress Committee, **Gandhiji** declared that it was a decision **\"To Do or Die\"**."
        },
        {
          "content_md": "Before the Congress could start the movement, the Government struck hard. Early in the morning of **August 9**, Gandhiji and other Congress leaders were arrested and taken to unknown destinations and the **Congress was once again declared illegal**."
        },
        {
          "content_md": "All over the country there were **strikes and demonstrations** which were lathi-charged and fired upon. People attacked the symbols of **British authority**—the police stations, post offices, railway stations, etc. National flags were hoisted on public buildings in defiance of the police. British authority disappeared in parts of **Uttar Pradesh, Bihar, West Bengal, Odisha, Andhra Pradesh, Tamil Nadu and Maharashtra**."
        },
        {
          "content_md": "In some areas such as **Ballia** in Eastern U.P., **Tamluk** in Midnapore district of West Bengal and **Satara** district of Maharashtra, the nationalists set up **parallel governments**.\n\n**Achyutrao Patwardhan, Jai Prakash Narayan, Ram Manohar Lohia, Aruna Asaf Ali** and **Nana Patil** were among the prominent leaders of the **underground movement**. They set up a **Central Directorate** at Mumbai. They kept the movement alive despite the government's repressive measures.\n\nThe movement also saw the active participation of women such as **Matangini Hazra** in Bengal, **Kanaklata Barua** in Assam and **Rama Devi** in Odisha. **Aruna Asaf Ali** hoisted the Indian National flag at the **Gowalia Tank ground**, now popularly known as **August Kranti Maidan**, Mumbai on **August 9, 1942**. She, along with **Usha Mehta**, also broadcasted news through an **underground radio station**."
        }
      ]
    },
    {
      "title": "Government's Repressive Measures",
      "sequence_number": 5,
      "depth": 0,
      "level_label": "Section",
      "children": [],
      "content_blocks": [
        {
          "content_md": "The government resorted to severe measures to crush the **1942 Movement**.\n*   The **Press was completely muzzled**.\n*   The demonstrating crowds were **machine-gunned** and even **bombed from the air**.\n*   **Prisoners were tortured**.\n*   The **police and secret police reigned supreme**.\n*   Nearly **ten thousand people were killed** and **60,000 people were arrested** by the end of 1942.\n\nThe military took over many towns and cities. Rebellious villages had to pay huge sums as **punitive fines** and the villagers had to undergo **mass floggings**. India had not witnessed such **intense repression** since the **First War of Independence, 1857**.\n\nGandhiji was detained at the **Agha Khan Palace in Pune**; the other leaders were sent to jail in **Ahmednagar Fort**. In the end, the government succeeded in crushing the movement."
        }
      ]
    },
    {
      "title": "The Significance of the Quit India Movement",
      "sequence_number": 6,
      "depth": 0,
      "level_label": "Section",
      "children": [],
      "content_blocks": [
        {
          "content_md": "The **Quit India Movement** made independence of India as the only agenda of the National Movement. It proved that there could be no retreat and future negotiations could only be on the manner of the **transfer of power**. The Movement had the following impact:\n\n1.  The Quit India Movement was in fact short-lived. Its importance lay in the fact that it demonstrated the depth that **nationalist feeling** had reached in the country and the great capacity for struggle and sacrifice that the people had developed.\n2.  It was evident that the British would no longer find it possible to rule India against the wishes of the people.\n3.  It was the **mass uprising** before attaining independence. People from all parts of India took part in processions and demonstrations. The Hindus, Muslims, Sikhs, Christians and Parsis and even people from the Princely States participated.\n4.  The Quit India Movement strengthened the **Congress Socialist Party** because of its heroic role in the movement. Its leader **Jai Prakash Narayan** became a legendary figure. The Party continued its underground movement till 1944 when it came to an end.\n5.  After the suppression of the Quit India Movement, the **Constitutional question** remained dormant till the close of the War in 1945.\n6.  After the suppression of the Quit India Movement of 1942, there was hardly any political activity inside the country till the War ended in 1945. The leaders of the National Movement were in jail, and no new leaders arose to take their place to give a new lead to the country.\n\nHenceforth, the battle for the freedom of India was carried on beyond the country's frontiers. It was led by the **Indian National Army** and its chief, **Subhas Chandra Bose**."
        }
      ]
    },
    {
      "title": "CHAPTER AT A GLANCE",
      "sequence_number": 7,
      "depth": 0,
      "level_label": "Section",
      "children": [
        {
          "title": "August Offer:",
          "sequence_number": 1,
          "depth": 1,
          "level_label": "Topic",
          "children": [],
          "content_blocks": [
            {
              "content_md": "A change of government took place in Britain in **May 1940**. **Winston Churchill** became Prime Minister and **L.S. Amery** took over as the Secretary of State for India. The War situation in Europe worsened. The fall of France and the danger of Nazi occupation of Britain temporarily softened the hard stance of Congress. On **June 1, 1940**, Gandhiji declared: '**We do not seek our independence out of British ruin**.'\n\nThe international compulsions forced the British Government and the British Indian Government to seek some settlement or understanding with the Congress. On **August 8, 1940** (on the eve of the Battle of Britain), **Lord Linlithgow**, the Viceroy, made a new offer known as the '**August Offer**'. The **Congress rejected** the offer because the minorities especially the **Muslim League** were assured that no constitutional scheme would be acceptable to the government unless and until it was agreed to by the minorities. The **Muslim League did not accept** the offer, as it did not give a clear assurance for the establishment of **Pakistan**."
            }
          ]
        },
        {
          "title": "The Cripps Mission:",
          "sequence_number": 2,
          "depth": 1,
          "level_label": "Topic",
          "children": [],
          "content_blocks": [
            {
              "content_md": "With the Japanese army rapidly advancing towards India, it became necessary for the British to break the political deadlock in India. **Churchill** announced in March 1942, that **Sir Stafford Cripps**, a member of the War Cabinet, would go to India for consultation with all the parties.\n\n[Image: Cripps with Gandhiji]"
            },
            {
              "content_md": "The **Cripps Mission** proposed the following Constitutional reforms:\n\n1.  India would be given a **Dominion Status** when the War would end. This Dominion would have the freedom to remain with the British Commonwealth or to secede from it.\n2.  A **Constituent Assembly** would be set up. It would consist of the members elected by the Lower House of the Indian Legislature and the representatives of the Princely States nominated by their rulers. It would be set up to draft a new Constitution.\n3.  There would be a **federation of British India and Indian States**. Any province that was not prepared to accept the Constitution would be allowed to obtain Dominion Status separately.\n4.  The Provinces would be free to join the **Indian Union**. If they would not join the Indian federation, they would formulate their own Constitutions which could have the same status as the Union of India.\n5.  An undertaking would be negotiated between His Majesty's Government and the **Constituent Assembly** covering all matters arising out of the complete transfer of responsibilities.\n6.  Provisions would also be made for the protection of the racial and religious minorities.\n7.  During the critical years of the War, the power of the **Viceroy** would remain as hitherto and he would be responsible for the defence of the country. But the task of organising the military and material resources of India would be the responsibility of the Government of India with the cooperation of the people of India."
            }
          ]
        },
        {
          "title": "Japanese Threat:",
          "sequence_number": 3,
          "depth": 1,
          "level_label": "Topic",
          "children": [],
          "content_blocks": [
            {
              "content_md": "The War situation was discouraging in **1942**. The **Japanese Army** had attacked **Burma (Myanmar)** and was marching towards **Assam**. **Gandhiji** observed, ‘The presence of British in India is an invitation to Japan to invade India. Their withdrawal removes the bait.’ The Indian leaders were anxious to save their country from the Japanese invasion but their slavery was a hindrance. **Gandhiji** and other leaders were convinced that this situation called for **complete independence** from the British immediately. **Gandhiji** said, ‘India’s safety, and Britain’s too, lies in the orderly and timely British withdrawal from India’. So they decided to launch a movement calling upon the British to quit India."
            }
          ]
        },
        {
          "title": "Quit India Resolution:",
          "sequence_number": 4,
          "depth": 1,
          "level_label": "Topic",
          "children": [],
          "content_blocks": [
            {
              "content_md": "In 1942, the failure of the **Cripps Mission** left no further meeting ground between the British Government and the Congress. **Mahatma Gandhi** felt that the British presence in India was an invitation to Japan to invade India and that their withdrawal would remove the bait. He therefore, asked the British \"to leave India in God's hands.\"\n\nThe **Congress Working Committee** met at **Wardha** in **July, 1942**. It adopted a resolution, known as the **Quit India Resolution**. The resolution stated: '**British rule in India must end immediately**.'"
            }
          ]
        },
        {
          "title": "The Significance of the Quit India Movement:",
          "sequence_number": 5,
          "depth": 1,
          "level_label": "Topic",
          "children": [],
          "content_blocks": [
            {
              "content_md": "The **Quit India movement** made independence of India as the only agenda of the **National Movement**. It proved that there could be no retreat and future negotiations could only be on the manner of the **transfer of power**. The Movement had the following impact:"
            },
            {
              "content_md": "1.  The **Quit India Movement** was in fact short-lived. Its importance lay in the fact that it demonstrated the depth that **nationalist feeling** had reached in the country and the great capacity for struggle and sacrifice that the people had developed.\n2.  It was evident that the British would no longer find it possible to rule India against the wishes of the people.\n3.  It was the **mass uprising** before attaining independence. People from all parts of India took part in processions and demonstrations. The Hindus, Muslims, Sikhs, Christians and Parsis and even people from the Princely States participated.\n4.  The **Quit India Movement** strengthened the **Congress Socialist Party** because of its heroic role in the movement. Its leader **Jai Prakash Narayan** became a legendary figure. The Party continued its underground movement till 1944 when it came to an end.\n5.  After the suppression of the **Quit India Movement**, the Constitutional question remained dormant till the close of the War in 1945.\n6.  After the suppression of the **Quit India Movement** of 1942, there was hardly any political activity inside the country till the War ended in 1945. The leaders of the **National Movement** were in jail, and no new leaders arose to take their place to give a new lead to the country.\n\nHenceforth, the battle for the freedom of India was carried on beyond the country's frontiers. It was led by the **Indian National Army** and its chief, **Subhas Chandra Bose**."
            }
          ]
        }
      ],
      "content_blocks": []
    },
    {
      "title": "EXERCISES",
      "sequence_number": 8,
      "depth": 0,
      "level_label": "Section",
      "children": [
        {
          "title": "Multiple-Choice Questions",
          "sequence_number": 1,
          "depth": 1,
          "level_label": "Topic",
          "children": [],
          "content_blocks": [
            {
              "content_md": ""
            }
          ]
        },
        {
          "title": "Short Answer Questions",
          "sequence_number": 2,
          "depth": 1,
          "level_label": "Topic",
          "children": [],
          "content_blocks": [
            {
              "content_md": ""
            }
          ]
        },
        {
          "title": "Structured Questions",
          "sequence_number": 3,
          "depth": 1,
          "level_label": "Topic",
          "children": [],
          "content_blocks": [
            {
              "content_md": ""
            }
          ]
        },
        {
          "title": "Higher Order Thinking Skills (HOTS)",
          "sequence_number": 4,
          "depth": 1,
          "level_label": "Topic",
          "children": [],
          "content_blocks": [
            {
              "content_md": ""
            }
          ]
        }
      ],
      "content_blocks": []
    }
  ],
  "additional_sections": [
    {
      "title": "Resignation of the Congress Ministries:",
      "content_md": "The Second World War broke out in September 1939 when Nazi Germany invaded Poland. Britain and France went to Poland's aid and declared war on Germany. The British Government of India immediately joined the War without consulting the National Congress or the elected members of the Central Legislature.\n\nThe Congress leaders asked how it was possible for an enslaved nation to aid others in their fight for freedom. They, therefore, demanded that India must be declared free or at least have effective power before it could actively participate in the War. Lord Linlithgow, the Viceroy, could not give any such assurance. He declared Dominion Status as the goal of British Policy in India. This was considered inadequate by the Congress.\n\nThe British government tried to pit the religious minorities and Princes against the Congress. The Congress, therefore, asked its ministries to resign.\n\nIn July 1937, the Congress had formed ministries in the United Provinces, Central Provinces, Orissa, Bihar, Madras and Bombay. Later, Assam and the North-West Frontier also came under the Congress rule. The resignation of the Congress ministries in October-November 1939 had many implications.\n\n(i) The Viceroy was happy because the Congress ministries had controlled several provinces.\n(ii) The ministries in Punjab, Bengal and Sind did not resign to win the government's goodwill.\n(iii) The Muslim League was jubilant over the resignation of Congress Ministries and offered its friendship to the British Government. It celebrated the day when the Congress ministries resigned as a 'day of deliverance' and 'thanks-giving.'\n\nA change came in the attitude of the Muslim League and Jinnah after the elections of 1937 and formation of the Congress Ministries in the Provinces. Jinnah and other leaders of the League proclaimed that Muslims could not expect any justice at the hands of the Congress.\n\nIn 1940, the Muslim League passed a resolution demanding the partition of the country and the creation of a State called Pakistan. The name Pakistan was derived from the letters of the provinces and communities that the new country would comprise: Punjab, Afghan (North-West Frontier Province), Kashmir, Sind and Baluchistan. Jinnah proclaimed that the division of India into two autonomous States was the only solution to the Indian problem.\n\n[Image: Jinnah with Gandhiji]"
    },
    {
      "title": "August Offer (1940):",
      "content_md": "A change of government took place in Britain in May 1940. Winston Churchill became Prime Minister and L.S. Amery took over as the Secretary of State for India. The War situation in Europe worsened. The fall of France and the danger of Nazi occupation of Britain temporarily softened the hard stance of Congress. On June 1, 1940, Gandhiji declared: 'We do not seek our independence out of British ruin.'\n\nThe international compulsions forced the British Government and the British Indian Government to seek some settlement or understanding with the Congress. On August 8, 1940 (on the eve of the Battle of Britain), Lord Linlithgow, the Viceroy, made a new offer known as the 'August Offer'. The Congress rejected the offer because the minorities especially the Muslim League were assured that no constitutional scheme would be acceptable to the government unless and until it was agreed to by the minorities. The Muslim League did not accept the offer, as it did not give a clear assurance for the establishment of Pakistan."
    },
    {
      "title": "The Cripps Mission (1942):",
      "content_md": "With the Japanese army rapidly advancing towards India, it became necessary for the British to break the political deadlock in India. Churchill announced in March 1942, that Sir Stafford Cripps, a member of the War Cabinet, would go to India for consultation with all the parties. The Cripps Mission proposed the following Constitutional reforms:\n\n[Image: Cripps with Gandhiji]\n\n(i) India would be given a Dominion Status when the War would end. This Dominion would have the freedom to remain with the British Commonwealth or to secede from it.\n(ii) A Constituent Assembly would be set up. It would consist of the members elected by the Lower House of the Indian Legislature and the representatives of the Princely States nominated by their rulers. It would be set up to draft a new Constitution.\n(iii) There would be a federation of British India and Indian States. Any province that was not prepared to accept the Constitution would be allowed to obtain Dominion Status separately.\n(iv) The Provinces would be free to join the Indian Union. If they would not join the Indian federation, they would formulate their own Constitutions which could have the same status as the Union of India.\n(v) An undertaking would be negotiated between His Majesty's Government and the Constituent Assembly covering all matters arising out of the complete transfer of responsibilities.\n(vi) Provisions would also be made for the protection of the racial and religious minorities.\n(vii) During the critical years of the War, the power of the Viceroy would remain as hitherto and he would be responsible for the defence of the country. But the task of organising the military and material resources of India would be the responsibility of the Government of India with the cooperation of the people of India."
    },
    {
      "title": "The Quit India Movement",
      "content_md": "The All-India Congress Committee met at Bombay on August 8, 1942 and passed the Quit India Resolution adopted at Wardha in July 1942. The Congress proposed to start a non-violent mass struggle under Gandhiji's leadership if this demand of immediate and complete independence was not conceded by the British. In his speech before the All India Congress Committee, Gandhiji declared that it was a decision \"To Do or Die\".\n\nBefore the Congress could start the movement, the Government struck hard. Early in the morning of August 9, Gandhiji and other Congress leaders were arrested and taken to unknown destinations and the Congress was once again declared illegal.\n\nAll over the country there were strikes and demonstrations which were lathi-charged and fired upon. People attacked the symbols of British authority—the police stations, post offices, railway stations, etc. National flags were hoisted on public buildings in defiance of the police. British authority disappeared in parts of Uttar Pradesh, Bihar, West Bengal, Odisha, Andhra Pradesh, Tamil Nadu and Maharashtra. In some areas such as Ballia in Eastern U.P., Tamluk in Midnapore district of West Bengal and Satara district of Maharashtra, the nationalists set up parallel governments.\n\nAchyutrao Patwardhan, Jai Prakash Narayan, Ram Manohar Lohia, Aruna Asaf Ali and Nana Patil were among the prominent leaders of the underground movement. They set up a Central Directorate at Mumbai. They kept the movement alive despite the government's repressive measures.\n\nThe movement also saw the active participation of women such as Matangini Hazra in Bengal, Kanaklata Barua in Assam and Rama Devi in Odisha. Aruna Asaf Ali hoisted the Indian National flag at the Gowalia Tank ground, now popularly known as August Kranti Maidan, Mumbai on August 9, 1942. She, along with Usha Mehta, also broadcasted news through an underground radio station."
    },
    {
      "title": "Government's Repressive Measures",
      "content_md": "The government resorted to severe measures to crush the 1942 Movement. The Press was completely muzzled. The demonstrating crowds were machine-gunned and even bombed from the air. Prisoners were tortured. The police and secret police reigned supreme. Nearly ten thousand people were killed and 60,000 people were arrested by the end of 1942.\n\nThe military took over many towns and cities. Rebellious villages had to pay huge sums as punitive fines and the villagers had to undergo mass floggings. India had not witnessed such intense repression since the First War of Independence, 1857.\n\nGandhiji was detained at the Agha Khan Palace in Pune; the other leaders were sent to jail in Ahmednagar Fort. In the end, the government succeeded in crushing the movement."
    }
  ],
  "needs_review": [
    "Multiple-Choice Questions",
    "Short Answer Questions",
    "Structured Questions",
    "Higher Order Thinking Skills (HOTS)"
  ],
  "manifest": {
    "syllabus_leaves": [
      {
        "path": "The Quit India Movement > Causes (failure of the Cripps Mission (clauses will not be tested), Japanese threat), Quit India Resolution and the significance of the Movement.",
        "path_titles": [
          "The Quit India Movement",
          "Causes (failure of the Cripps Mission (clauses will not be tested), Japanese threat), Quit India Resolution and the significance of the Movement."
        ],
        "title": "Causes (failure of the Cripps Mission (clauses will not be tested), Japanese threat), Quit India Resolution and the significance of the Movement.",
        "sequence_number": 1,
        "depth": 1,
        "level_label": "Topic",
        "has_notes": true
      },
      {
        "path": "EVENTS LEADING TO QUIT INDIA MOVEMENT > Resignation of the Congress Ministries:",
        "path_titles": [
          "EVENTS LEADING TO QUIT INDIA MOVEMENT",
          "Resignation of the Congress Ministries:"
        ],
        "title": "Resignation of the Congress Ministries:",
        "sequence_number": 1,
        "depth": 1,
        "level_label": "Topic",
        "has_notes": true
      },
      {
        "path": "EVENTS LEADING TO QUIT INDIA MOVEMENT > August Offer (1940):",
        "path_titles": [
          "EVENTS LEADING TO QUIT INDIA MOVEMENT",
          "August Offer (1940):"
        ],
        "title": "August Offer (1940):",
        "sequence_number": 2,
        "depth": 1,
        "level_label": "Topic",
        "has_notes": true
      },
      {
        "path": "EVENTS LEADING TO QUIT INDIA MOVEMENT > The Cripps Mission (1942):",
        "path_titles": [
          "EVENTS LEADING TO QUIT INDIA MOVEMENT",
          "The Cripps Mission (1942):"
        ],
        "title": "The Cripps Mission (1942):",
        "sequence_number": 3,
        "depth": 1,
        "level_label": "Topic",
        "has_notes": true
      },
      {
        "path": "EVENTS LEADING TO QUIT INDIA MOVEMENT > Failure of the Cripps Mission:",
        "path_titles": [
          "EVENTS LEADING TO QUIT INDIA MOVEMENT",
          "Failure of the Cripps Mission:"
        ],
        "title": "Failure of the Cripps Mission:",
        "sequence_number": 4,
        "depth": 1,
        "level_label": "Topic",
        "has_notes": true
      },
      {
        "path": "EVENTS LEADING TO QUIT INDIA MOVEMENT > Japanese Threat:",
        "path_titles": [
          "EVENTS LEADING TO QUIT INDIA MOVEMENT",
          "Japanese Threat:"
        ],
        "title": "Japanese Threat:",
        "sequence_number": 5,
        "depth": 1,
        "level_label": "Topic",
        "has_notes": true
      },
      {
        "path": "QUIT INDIA RESOLUTION",
        "path_titles": [
          "QUIT INDIA RESOLUTION"
        ],
        "title": "QUIT INDIA RESOLUTION",
        "sequence_number": 3,
        "depth": 0,
        "level_label": "Section",
        "has_notes": true
      },
      {
        "path": "The Quit India Movement",
        "path_titles": [
          "The Quit India Movement"
        ],
        "title": "The Quit India Movement",
        "sequence_number": 4,
        "depth": 0,
        "level_label": "Section",
        "has_notes": true
      },
      {
        "path": "Government's Repressive Measures",
        "path_titles": [
          "Government's Repressive Measures"
        ],
        "title": "Government's Repressive Measures",
        "sequence_number": 5,
        "depth": 0,
        "level_label": "Section",
        "has_notes": true
      },
      {
        "path": "The Significance of the Quit India Movement",
        "path_titles": [
          "The Significance of the Quit India Movement"
        ],
        "title": "The Significance of the Quit India Movement",
        "sequence_number": 6,
        "depth": 0,
        "level_label": "Section",
        "has_notes": true
      },
      {
        "path": "CHAPTER AT A GLANCE > August Offer:",
        "path_titles": [
          "CHAPTER AT A GLANCE",
          "August Offer:"
        ],
        "title": "August Offer:",
        "sequence_number": 1,
        "depth": 1,
        "level_label": "Topic",
        "has_notes": true
      },
      {
        "path": "CHAPTER AT A GLANCE > The Cripps Mission:",
        "path_titles": [
          "CHAPTER AT A GLANCE",
          "The Cripps Mission:"
        ],
        "title": "The Cripps Mission:",
        "sequence_number": 2,
        "depth": 1,
        "level_label": "Topic",
        "has_notes": true
      },
      {
        "path": "CHAPTER AT A GLANCE > Japanese Threat:",
        "path_titles": [
          "CHAPTER AT A GLANCE",
          "Japanese Threat:"
        ],
        "title": "Japanese Threat:",
        "sequence_number": 3,
        "depth": 1,
        "level_label": "Topic",
        "has_notes": true
      },
      {
        "path": "CHAPTER AT A GLANCE > Quit India Resolution:",
        "path_titles": [
          "CHAPTER AT A GLANCE",
          "Quit India Resolution:"
        ],
        "title": "Quit India Resolution:",
        "sequence_number": 4,
        "depth": 1,
        "level_label": "Topic",
        "has_notes": true
      },
      {
        "path": "CHAPTER AT A GLANCE > The Significance of the Quit India Movement:",
        "path_titles": [
          "CHAPTER AT A GLANCE",
          "The Significance of the Quit India Movement:"
        ],
        "title": "The Significance of the Quit India Movement:",
        "sequence_number": 5,
        "depth": 1,
        "level_label": "Topic",
        "has_notes": true
      },
      {
        "path": "EXERCISES > Multiple-Choice Questions",
        "path_titles": [
          "EXERCISES",
          "Multiple-Choice Questions"
        ],
        "title": "Multiple-Choice Questions",
        "sequence_number": 1,
        "depth": 1,
        "level_label": "Topic",
        "has_notes": false
      },
      {
        "path": "EXERCISES > Short Answer Questions",
        "path_titles": [
          "EXERCISES",
          "Short Answer Questions"
        ],
        "title": "Short Answer Questions",
        "sequence_number": 2,
        "depth": 1,
        "level_label": "Topic",
        "has_notes": false
      },
      {
        "path": "EXERCISES > Structured Questions",
        "path_titles": [
          "EXERCISES",
          "Structured Questions"
        ],
        "title": "Structured Questions",
        "sequence_number": 3,
        "depth": 1,
        "level_label": "Topic",
        "has_notes": false
      },
      {
        "path": "EXERCISES > Higher Order Thinking Skills (HOTS)",
        "path_titles": [
          "EXERCISES",
          "Higher Order Thinking Skills (HOTS)"
        ],
        "title": "Higher Order Thinking Skills (HOTS)",
        "sequence_number": 4,
        "depth": 1,
        "level_label": "Topic",
        "has_notes": false
      }
    ],
    "stray_leaves": [
      {
        "title": "Resignation of the Congress Ministries:",
        "insert_after_index": -1,
        "micro_topics": [],
        "has_notes": true
      },
      {
        "title": "August Offer (1940):",
        "insert_after_index": -1,
        "micro_topics": [],
        "has_notes": true
      },
      {
        "title": "The Cripps Mission (1942):",
        "insert_after_index": -1,
        "micro_topics": [],
        "has_notes": true
      },
      {
        "title": "The Quit India Movement",
        "insert_after_index": 1,
        "micro_topics": [],
        "has_notes": true
      },
      {
        "title": "Government's Repressive Measures",
        "insert_after_index": 1,
        "micro_topics": [],
        "has_notes": true
      }
    ]
  }
}