{
  "board": "ICSE",
  "grade": 10,
  "subject": "HistoryCivics",
  "book_slug": "TotalHistoryCivics_MorningStar_DollyESequeira",
  "book_meta": {
    "book_name": "Total History & Civics",
    "publication": "Morning Star",
    "author": "Dolly E. Sequeira"
  },
  "chapter_sequence_number": 1,
  "chapter_title": "The Union Parliament",
  "discipline": "civics",
  "reconciliation": {
    "outline": [
      "I. THE UNION LEGISLATURE",
      "Federal Setup in India",
      "Important Features of Federalism",
      "Non-Federal or Unitary Features",
      "A Strong Centre",
      "A Single Constitution for Union and States",
      "Flexibility of the Constitution",
      "Single Citizenship",
      "Inequality of Representation in the Rajya Sabha",
      "Existence of Union Territories",
      "THE UNION PARLIAMENT",
      "LOK SABHA",
      "Term",
      "Composition",
      "Qualifications for Membership",
      "Disqualification of Membership",
      "Vacation of Seats",
      "PARLIAMENTARY PROCEDURES",
      "Sessions",
      "Quorum",
      "Questions",
      "Question Hour",
      "Types of Questions",
      "Zero Hour",
      "Motion",
      "Adjournment Motion",
      "No-Confidence Motion",
      "The No-Confidence Motions of the Past",
      "Adjournment and Prorogation of the House",
      "ANTI-DEFECTION LAW",
      "PASSING OF BILLS",
      "Ordinary Bills",
      "MONEY BILLS",
      "SPEAKER OF THE LOK SABHA",
      "Election",
      "Removal",
      "Deputy Speaker",
      "ROLE AND FUNCTIONS OF THE SPEAKER",
      "The Business of the House",
      "Administrative Functions",
      "Disciplinary Functions",
      "Parliamentary Committees",
      "Miscellaneous Functions"
    ],
    "in_syllabus_only": [],
    "in_pdf_only": [
      {
        "title": "Non-Federal or Unitary Features",
        "insert_after_index": 1,
        "micro_topics": [
          "A Strong Centre",
          "A Single Constitution for Union and States",
          "Flexibility of the Constitution",
          "Single Citizenship",
          "Inequality of Representation in the Rajya Sabha",
          "Existence of Union Territories"
        ]
      },
      {
        "title": "THE UNION PARLIAMENT",
        "insert_after_index": 1,
        "micro_topics": []
      },
      {
        "title": "ROLE AND FUNCTIONS OF THE SPEAKER",
        "insert_after_index": 24,
        "micro_topics": [
          "The Business of the House",
          "Administrative Functions",
          "Disciplinary Functions",
          "Parliamentary Committees",
          "Miscellaneous Functions"
        ]
      }
    ],
    "additional_sections": [
      {
        "title": "Non-Federal or Unitary Features",
        "content_md": "The Constitution of India has certain non-federal or unitary features which have led the critics to say that it is not merely federal in form but unitary in spirit. Some of the important unitary features of our Constitution are as under:\n\n1.  **A Strong Centre:** The Constitution of India provides for a strong Centre, a feature of unitary government. The Seventh Schedule of the Constitution of India defines and specifies allocation of powers and functions between Union and States. For this division of powers there are three lists, namely, the Union List, the State List and the Concurrent List. The Union Government has exclusive powers to legislate on matters relating to the Union List whereas the State Governments have exclusive power to legislate on matters in the State List. In the Concurrent List, both the Centre and the States have power to legislate, but the Central Government enjoys an overriding position.\n2.  **A Single Constitution for Union and States:** The States in India have not been given any right to make their own Constitution. The framers of the Constitution have provided for a single common and unified Constitution, both for the Centre and the States.\n3.  **Flexibility of the Constitution:** The Constitution of India is rather flexible. In other federations, amendments to the Constitution can be made only with the consent and approval of the units. In India, the Parliament can amend most of the provisions of the Constitution single-handedly, either by a simple majority or by a two-thirds majority.\n4.  **Single Citizenship:** The Indian Constitution provides for single citizenship of India which is common to all the people of various States and Union Territories.\n5.  **Inequality of Representation in the Rajya Sabha:** Our Constitution does not accord equal representation to all the States. It accords representation to the various States in the Rajya Sabha on the basis of their population. This means that the States with larger populations send more representatives in comparison to the States with smaller population. Further, the Rajya Sabha also has 12 members nominated by the President from amongst persons who have specialised in the field of art, literature, science and social services. This is a clear departure from the federal principle.\n6.  **Existence of Union Territories:** Another feature, which is a clear pointer to the unitary character of the Indian Constitution, is the existence of administrative units known as the Union Territories. These units are directly governed by the Central Government and do not enjoy any independent powers or autonomy."
      },
      {
        "title": "THE UNION PARLIAMENT",
        "content_md": "The Union Legislature comprises the President and the two Houses of Parliament: the House of the People (the Lok Sabha) and the Council of States (the Rajya Sabha).\n\nIn a democracy, people are their own masters. Ours is a representative democracy where people exercise their sovereign power through their elected representatives. The Parliament is the body of people's representatives who have supreme power of governance in a democratic country."
      },
      {
        "title": "ROLE AND FUNCTIONS OF THE SPEAKER",
        "content_md": "The role and functions of the Speaker may be categorised under the following heads:\n\n**The Business of the House**\n1. The Speaker presides over the meetings of the House. All speeches and remarks are addressed to the Speaker. He/She allots time for discussion.\n2. The Speaker interprets the rules of procedure of the House. His/Her decision in all parliamentary matters is final.\n3. All Bills passed by the House are signed by him/her before they are sent to the Rajya Sabha for its consideration or to the President for assent.\n4. The Speaker decides the admissibility of all questions and resolutions. He/She decides the admissibility of a motion of adjournment.\n5. He/She puts the issues to vote and announces the results. The Speaker does not vote in the House, except when there are equal votes on both sides, i.e., the Treasury Benches and the Opposition.\n6. The Speaker decides whether a Bill is a Money Bill or not.\n\n**Administrative Functions**\n1. The Speaker receives all petitions and documents in the House.\n2. He/She communicates the decisions of the House to the concerned authorities.\n3. He/She regulates the admission of visitors and Press correspondents to the galleries of the House.\n\n**Disciplinary Functions**\n1. The Speaker maintains order in the House. When members become unruly, he/she may order them to withdraw. He may suspend a member, if he/she disregards the authority of the Chair. In case of grave disorder, he/she can adjourn the House.\n2. In case the words used by a member are indecent or unparliamentary, the Speaker may order that such words be expunged from the proceedings of the House.\n3. The Speaker decides whether there is a case for a matter relating to a breach of privilege or contempt of the House.\n4. In regard to a question whether a Member of Lok Sabha stands disqualified under Anti-Defection Law, the question shall be referred to the decision of the Speaker. The Constitution says that Speaker's decision shall be final and no court shall have any jurisdiction in this regard.\n\n**Parliamentary Committees**\n1. The Speaker is the ex-officio Chairman of some of the Committees of the House, such as the Business Advisory Committee and the Rules Committee.\n2. He/She appoints Chairmen of all the Committees of the House.\n3. He/She issues directions to the Chairmen in all matters relating to their working and the procedure to be followed.\n\n**Miscellaneous Functions**\n1. The Speaker presides over the joint sessions of both the Houses of Parliament.\n2. In consultation with the Chairman of the Rajya Sabha, he/she nominates personnel for Parliamentary Delegations to various countries.\n3. He/she presides over the Conference of Presiding Officers of legislative bodies in India."
      }
    ]
  },
  "nodes": [
    {
      "title": "The Union Legislature",
      "sequence_number": 1,
      "depth": 0,
      "level_label": "Section",
      "children": [
        {
          "title": "Meaning of the Federal Setup in India",
          "sequence_number": 1,
          "depth": 1,
          "level_label": "Topic",
          "children": [],
          "content_blocks": [
            {
              "content_md": "**Federalism** is a system of government in which the power is divided between a central authority and various constituent units of the country. In contrast to a federal government, a **unitary government** is the one in which there is only one level of government with the sub-units being subordinate to the Central Government.\n\nIn a **federal system of government**, all the administrative powers are divided between the Central and the State governments and both are supreme within their respective spheres according to the Constitution. The State Governments are neither the agents of the Central Government nor do they draw their authority from it. On the other hand, both the Central and State Governments draw their authority from the same Constitution. India has opted for a federal system of Government, though with a strong unitary bias."
            },
            {
              "content_md": "### Federal Setup in India\nThe Constitution of India has provided for a federal system of Government, though the term **'federation'** has nowhere been used in the Constitution.\n\nThe Constitution of India originally provided for a **two-tier government** — the Union government and the State governments. Later, a third level of federalism was added in the form of **Panchayats** and **Municipalities**. In India, the power is divided between the Central government and the constituent States. However, the Central government is more powerful than the States.\n\n1.  **India is a large country with 28 States and eight Union Territories**. It is not possible in the Indian federal system for the States to break away as a separate unit from the union of India. This is essential for maintaining the unity and integrity of India.\n2.  A **federal system is the only system suitable to a country like India**, consisting of various types of people. This is of utmost importance if India is to be saved from separatist forces fighting for fragmentation and provincialism of the country.\n3.  There is a **division of legislative and administrative powers between the Union and the State Governments** and none of them could violate the limitations imposed by the Constitution. The Supreme Court stands at the head of Judiciary to safeguard this distribution of powers and to prevent any action which violates the limitations imposed by the Constitution.\n4.  The States have been given the right to participate in the functioning of the government. India has a **bicameral legislature**, i.e., the **Lok Sabha** and the **Rajya Sabha**. The Rajya Sabha mainly comprises representatives of the States.\n5.  No system of federation can be successful unless both the Union and the States have **adequate financial resources** to enable them to discharge their duties. The Constitution of India has made provisions for the distribution of revenue between the Centre and the States. This has ensured equitable distribution of the financial resources between the two units."
            },
            {
              "content_md": "### Important Features of Federalism\n*   There are **two or more levels of government** and the different levels of government govern the same citizens, but each level has its own **jurisdiction** (legal authority) in specific matters of legislation, administration and taxation.\n*   The jurisdiction of each level of government is specified in the Constitution.\n*   The **fundamental provisions of the Constitution cannot be unilaterally changed** by any one level of government. Such changes can be made by the consent of both the levels of government.\n*   The **disputes between different levels of government** which arise due to the exercise of their respective powers are settled by the courts.\n*   **Sources of revenue** for each level of government are clearly demarcated to ensure their financial autonomy."
            }
          ]
        },
        {
          "title": "Lok Sabha",
          "sequence_number": 2,
          "depth": 1,
          "level_label": "Topic",
          "children": [
            {
              "title": "Term",
              "sequence_number": 1,
              "depth": 2,
              "level_label": "Subtopic",
              "children": [],
              "content_blocks": [
                {
                  "content_md": "According to the Constitution the term of the **Lok Sabha** is **five years**. However, it can be dissolved before the expiry of its normal term by the **President** on the advice of the **Prime Minister**.\n\nDuring the proclamation of an emergency the period of the Lok Sabha may be extended by Parliament for **one year at a time**. The new Lok Sabha must be elected within **six months** after the national emergency is lifted."
                }
              ]
            },
            {
              "title": "Composition",
              "sequence_number": 2,
              "depth": 2,
              "level_label": "Subtopic",
              "children": [],
              "content_blocks": [
                {
                  "content_md": "The **maximum strength** of the **Lok Sabha**, as provided by the Constitution is **550**. Out of this,\n(i) not more than **530 members** shall represent the **States**;\n(ii) not more than **20 members** shall represent the **Union Territories**;\n\nThe **104th Constitutional Amendment Act** passed in January 2020 did away with the provision of nomination of **Anglo-Indians** to Lok Sabha and certain state assemblies. The reservation was provided for a period of 70 years which expired on **January 25, 2020**."
                },
                {
                  "content_md": "The number of members that can be elected to the Lok Sabha from a state depends on the **population of that state**. Uttar Pradesh is represented in the Lok Sabha by 80 members; Maharashtra sends 48 members; Goa, Manipur and Meghalaya two each; and Mizoram, Nagaland and Sikkim one each. The Union Territory of Delhi sends seven members to the Lok Sabha.\n\n[Image: Lok Sabha Chamber]"
                }
              ]
            },
            {
              "title": "Qualifications for Membership",
              "sequence_number": 3,
              "depth": 2,
              "level_label": "Subtopic",
              "children": [],
              "content_blocks": [
                {
                  "content_md": "Conditions needed for a person to be a member of the **Lok Sabha** are:\n\n1.  He/She should be an **Indian citizen**.\n2.  He/She should be at least **25 years of age**.\n3.  He/She should have his name in the **electoral rolls** in some part of the country.\n4.  He/She should **not be an insolvent** i.e., he/she should not be in debt and should have the ability to meet his/her financial commitments.\n5.  He/She should **not hold any office of profit** under the government.\n6.  He/She should **not be a proclaimed criminal**.\n7.  He/She should **not be of unsound mind**."
                }
              ]
            },
            {
              "title": "Disqualification of Membership",
              "sequence_number": 4,
              "depth": 2,
              "level_label": "Subtopic",
              "children": [],
              "content_blocks": [
                {
                  "content_md": "A person shall be disqualified for being chosen as, and for being, a member of either House of Parliament—\n1. if he/she holds any **office of profit** under the Government of India or the Government of any State (other than an office exempted by Parliament by law) but not a Minister for the Union or for a State;\n2. if he/she is of **unsound mind** and stands so declared by a competent Court;\n3. if he/she is an **undischarged insolvent**;\n4. if he/she is not a **citizen of India** or has voluntarily acquired citizenship of a foreign State or is under an acknowledgment of allegiance or adherence to a foreign power;\n5. if he/she is so disqualified by or under any law made by Parliament."
                },
                {
                  "content_md": "If any question arises as to whether a member of either House of Parliament has become subject to any of the above disqualifications, the **President's decision**, in accordance with the opinion of the **Election Commission**, shall be **final**.\n\nA penalty may be imposed upon a person who sits or votes in either House of Parliament knowing that he/she is not qualified or that he/she is disqualified for membership thereof."
                }
              ]
            },
            {
              "title": "Vacation of Seats",
              "sequence_number": 5,
              "depth": 2,
              "level_label": "Subtopic",
              "children": [],
              "content_blocks": [
                {
                  "content_md": "The seat of a member of either House of Parliament becomes vacant in the following situations:\n\n1.  If a member resigns his/her seat by writing to the **Speaker** or to the **Chairman**, as the case may be.\n2.  If a member is, without permission of the House, absent from all meetings for a period of **60 days**. In computing the said period, no account is taken of any period during which the House is **prorogued** or is **adjourned** for more than four consecutive days.\n3.  If a member becomes subject to any of the **disqualifications** laid down in the Constitution or an Act of Parliament.\n4.  If a person is already a member of the **State Legislature** and is elected to the **Parliament**, he/she has to vacate his/her seat in the State Legislature or vice versa.\n5.  If a person is disqualified from being a member on grounds of **Defection** under the **Anti-Defection Law**. According to the Anti-Defection Law, when a member of a House gives up the membership of his/her party or votes against the direction given by the party to which he/she belongs, he/she shall be disqualified from being a member of the House, provided there is not a split in the party with at least one third of its members."
                }
              ]
            }
          ],
          "content_blocks": []
        }
      ],
      "content_blocks": []
    },
    {
      "title": "Parliamentary procedures",
      "sequence_number": 2,
      "depth": 0,
      "level_label": "Section",
      "children": [
        {
          "title": "Sessions",
          "sequence_number": 1,
          "depth": 1,
          "level_label": "Topic",
          "children": [],
          "content_blocks": [
            {
              "content_md": "A **session** is a formal period when both Houses of Parliament convene to conduct their business, which includes discussions and the passage of legislation. The **President** summons each House of Parliament. Each House shall meet at least twice a year and the interval between two consecutive sessions shall be less than six months. Normally there are three sessions in a year:\n- The **Budget session** (February-May)\n- The **Monsoon session** (July-August)\n- The **Winter session** (November-December)"
            }
          ]
        },
        {
          "title": "Quorum",
          "sequence_number": 2,
          "depth": 1,
          "level_label": "Topic",
          "children": [],
          "content_blocks": [
            {
              "content_md": "The **quorum** means the **minimum number of members** required to be present in the House to enable it to transact its business. The quorum of the **Lok Sabha** and the **Rajya Sabha** is **one-tenth of the total membership** of each house. This means that the House cannot conduct its proceedings and pass Bills and resolutions without the presence of at least one-tenth of its total membership. The **Speaker** may **adjourn the House** or **suspend the meeting** until there is a requisite quorum."
            }
          ]
        },
        {
          "title": "Questions",
          "sequence_number": 3,
          "depth": 1,
          "level_label": "Topic",
          "children": [
            {
              "title": "Question Hour",
              "sequence_number": 1,
              "depth": 2,
              "level_label": "Subtopic",
              "children": [],
              "content_blocks": [
                {
                  "content_md": "The first hour on every working day of the **Lok Sabha** is reserved for questions unless otherwise decided by the **Speaker**. This hour (which usually starts at 11 am) is known as the **Question Hour**. It is intended to keep the functioning of the government open to scrutiny by the members."
                }
              ]
            },
            {
              "title": "Types of Questions",
              "sequence_number": 2,
              "depth": 2,
              "level_label": "Subtopic",
              "children": [],
              "content_blocks": [
                {
                  "content_md": "All questions are addressed to the Chair and, if admitted, the Government is obliged to answer them. A member has to give ten days' notice for a question. There are three types of questions:\n\n1. **Starred Questions** are those to which a member wishes to have an oral answer on the floor of the House. Such questions are indicated by an asterisk mark. Supplementary questions may be asked after replies to such questions are given by the Ministers.\n2. **Unstarred Questions** are questions to which answers are given in a written form. No supplementary questions can be asked thereon.\n3. **Short Notice Questions** relate to a matter of urgent importance. Such questions are asked with a notice shorter than of ten days. The Minister concerned has to be asked whether he can reply to the question at a short notice. It is for him to accept or not to accept short notice questions."
                }
              ]
            }
          ],
          "content_blocks": []
        },
        {
          "title": "Zero Hour",
          "sequence_number": 4,
          "depth": 1,
          "level_label": "Topic",
          "children": [],
          "content_blocks": [
            {
              "content_md": "The **Zero Hour** refers to the period which begins at **12 o'clock** soon after the **Question Hour** and continues till the lunch break which begins at one o'clock. During the **Zero Hour** members raise all types of questions, without any permission or prior notice. The **Presiding Officer** controls the House, when faced with heated discussions, charges and counter-charges and constant interruptions by the members."
            }
          ]
        },
        {
          "title": "Motion",
          "sequence_number": 5,
          "depth": 1,
          "level_label": "Topic",
          "children": [],
          "content_blocks": [
            {
              "content_md": "A **Motion** is a **formal proposal** made by a member stating that the House should take up some particular matter which is of **public importance**. With the help of the motion, the members draw attention of the Government to take suitable action on a particular matter."
            }
          ]
        },
        {
          "title": "Adjournment Motion",
          "sequence_number": 6,
          "depth": 1,
          "level_label": "Topic",
          "children": [],
          "content_blocks": [
            {
              "content_md": "An **Adjournment Motion** means a proposal to lay aside all other business and take up a **'definite matter of urgent importance'**. Such a Motion leads to the interruption of normal business of the House. Adjournment Motions are generally allowed on subjects such as: a railway accident resulting in the death of several persons; a daring dacoity, some natural calamity like a devastating flood or a tornado, communal tension, etc."
            }
          ]
        },
        {
          "title": "No-Confidence Motion",
          "sequence_number": 7,
          "depth": 1,
          "level_label": "Topic",
          "children": [],
          "content_blocks": [
            {
              "content_md": "A **No-Confidence Motion** is a proposal expressing lack of confidence in the ruling government by the **Opposition**. The **Council of Ministers** is collectively responsible to the entire **Lok Sabha** including the members of the Opposition. No-Confidence in the Government is moved by the Opposition. The House grants leave to move No-Confidence Motion only when it has the support of at least **50 members**. The Motion has to be taken up for discussion within **10 days** from the day on which the leave is granted. On conclusion of the debate, the Speaker puts the Motion to vote. If the Motion is passed, the Government has to **resign**.\n\n**Confidence Motion** is the reverse of the **No-Confidence Motion**. Sometimes a No-Confidence or Confidence Motion assumes much importance—even a single vote counts. In the 12th Lok Sabha, the government headed by **Shri Atal Bihari Vajpayee** lost a Confidence Motion just by one vote. The government collapsed and general elections were held."
            },
            {
              "content_md": "### The No-Confidence Motions of the Past\nSince 1952, 28 different **No-Confidence Motions (NCM)** have been moved against different governments. Twenty-seven motions were defeated by the government in power, except one in 1979 when the then-Prime Minister **Morarji Desai** resigned before voting could begin. **Indira Gandhi** faced the most no-confidence motions, 15 in all. None of them resulted in the fall of her government. **Lal Bahadur Shastri** faced the most per year of office, and **Narasimha Rao** won with the narrowest margin.\n\nOn July 26, 2024 the Lok Sabha accepted a no-confidence motion submitted by Gaurav Gogoi from the opposition alliance INDIA against the Narendra Modi government. It is interesting to note that thrice governments have fallen during **Vote of Confidence**."
            }
          ]
        },
        {
          "title": "Adjournment and Prorogation of the House",
          "sequence_number": 8,
          "depth": 1,
          "level_label": "Topic",
          "children": [],
          "content_blocks": [
            {
              "content_md": "**Adjournment** of the House means suspension of the sitting of the House by the Speaker.\n\n**Prorogation** means termination of the session of Parliament.\n\nThe power of adjournment of the House rests with the **Speaker** or the **Chairman** as the case may be; and the power of prorogation of a session belongs to the **President**.\n\nThe House is also adjourned:\n1. after the business for the day is over;\n2. when the death of a sitting/ex-member of the House occurs;\n3. when there is so much disorder in the House that it is difficult to conduct the business;\n4. for want of quorum; or\n5. as and when the Speaker finds it necessary.\n\n**Adjournment sine die** (Latin for 'without a date') is the suspension of a parliamentary session for an indefinite period, meaning there is no specific date set for it to resume. The Speaker has the power to declare an adjournment sine die of a House, which can happen when the session's business is concluded."
            }
          ]
        }
      ],
      "content_blocks": []
    },
    {
      "title": "Anti-Defection Law",
      "sequence_number": 3,
      "depth": 0,
      "level_label": "Section",
      "children": [],
      "content_blocks": [
        {
          "content_md": "The **Constitutional Act (52nd Amendment) 1985**, popularly known as the **Anti-Defection Law** added a new schedule (**10th Schedule**) to the Constitution setting out certain provisions regarding vacation of seats and disqualification from membership of Parliament and State Legislature on grounds of defection. These conditions are:\n\n*   An elected member of Parliament or a State Legislature, who has been elected as a candidate set up by a political party, would be disqualified on the ground of **defection**, if he/she voluntarily relinquishes his/her membership of such political party or votes or abstains from voting in the House contrary to any direction of such party;\n*   A nominated member of Parliament or a State Legislature who is a member of a political party at the time he/she takes his/her seat would be disqualified on the ground of defection if he/she voluntarily gives up his/her membership of the party or votes or abstains from voting in the House contrary to the directions of the party.\n*   A nominated member of Parliament or a State Legislature who is not a member of a political party at the time of his/her nomination and who has not become a member of any political party before the expiry of six months from the date on which he/she takes his/her seat would be disqualified, if he/she joins any political party after the expiry of the said period of six months;\n*   An independent member of Parliament or a State Legislature will be disqualified if he/she joins any political party after his/her elections;\n*   No disqualification would be incurred where a member claims that he/she belongs to a group representing a faction arising from a **split** and the group consists of not less than **one-third** of the members of the legislative party. In case of a **merger** the members joining should not be less than **two-thirds** of the members of the legislative party concerned.\n\n**Exemption:** A person who has been elected to the office of **Speaker, Deputy Speaker, Chairman or Deputy Chairman** shall not be disqualified, if he/she, voluntarily gives up membership of the political party to which he/she belonged upon election to his/her office and rejoins his/her political party after he/she ceases to hold such an office."
        }
      ]
    },
    {
      "title": "Passing of Bills",
      "sequence_number": 4,
      "depth": 0,
      "level_label": "Section",
      "children": [
        {
          "title": "Ordinary Bills",
          "sequence_number": 1,
          "depth": 1,
          "level_label": "Topic",
          "children": [],
          "content_blocks": [
            {
              "content_md": "An **Ordinary Bill** may be introduced in any of the two Houses of the Parliament. It may be introduced by a Minister in the Government, or by a private member of the House. In the former case, it is called a **Government Bill** and in the latter case, it is known as a **Private Member's Bill**. The process of considering a bill is called **Reading**. A Bill goes through three such readings in each House."
            }
          ]
        },
        {
          "title": "Money Bills",
          "sequence_number": 2,
          "depth": 1,
          "level_label": "Topic",
          "children": [],
          "content_blocks": [
            {
              "content_md": "As far as the **Money Bills** are concerned they first require the ruling of the **Speaker of the Lok Sabha** as to whether it is a **Money Bill** or not. A **Money Bill** can be introduced in the Parliament only with the consent of the **President of India**."
            },
            {
              "content_md": "As far as **Money Bills** are concerned, there is an important difference in the powers of the two Houses. A **Money Bill** can be introduced in the **Lok Sabha** only and not in the **Rajya Sabha**. However, when it is passed in the **Lok Sabha** it is sent to the **Rajya Sabha**. The **Rajya Sabha** cannot reject a **Money Bill**. It can give its suggestion within **14 days**. In fact, the **Rajya Sabha** has to return the Bill within a period of **14 days** with or without its recommendations. The **Lok Sabha** can reject all or any of its recommendations. The **Lok Sabha** thus, is the final authority so far as the **Money Bills** are concerned. If the **Rajya Sabha** does not return the Bill within **14 days**, the Bill is deemed to have been passed by both the houses. Thereafter, the Bill is sent to the **President** for assent."
            }
          ]
        }
      ],
      "content_blocks": []
    },
    {
      "title": "Speaker of the Lok Sabha",
      "sequence_number": 5,
      "depth": 0,
      "level_label": "Section",
      "children": [],
      "content_blocks": [
        {
          "content_md": "The **Speaker** is the presiding officer of the **Lok Sabha** who conducts the business of the House. He/She occupies a position of great authority and responsibility. He/She has wide powers to maintain discipline in the House. Once elected to the office, the speaker does not have affiliation to any party and works in an impartial manner. He/She acts as the **guardian of the rights and privileges of the members**."
        },
        {
          "content_md": "In the **Table of Precedence** he/she ranks higher than all Cabinet Ministers, other than the Prime Minister. With respect to the discharge of his/her powers and functions, the **Speaker** is not answerable to anyone except the House. No court of law can go into the merits of a ruling given by him/her."
        }
      ]
    }
  ],
  "additional_sections": [
    {
      "title": "Non-Federal or Unitary Features",
      "content_md": "The Constitution of India has certain non-federal or unitary features which have led the critics to say that it is not merely federal in form but unitary in spirit. Some of the important unitary features of our Constitution are as under:\n\n1.  **A Strong Centre:** The Constitution of India provides for a strong Centre, a feature of unitary government. The Seventh Schedule of the Constitution of India defines and specifies allocation of powers and functions between Union and States. For this division of powers there are three lists, namely, the Union List, the State List and the Concurrent List. The Union Government has exclusive powers to legislate on matters relating to the Union List whereas the State Governments have exclusive power to legislate on matters in the State List. In the Concurrent List, both the Centre and the States have power to legislate, but the Central Government enjoys an overriding position.\n2.  **A Single Constitution for Union and States:** The States in India have not been given any right to make their own Constitution. The framers of the Constitution have provided for a single common and unified Constitution, both for the Centre and the States.\n3.  **Flexibility of the Constitution:** The Constitution of India is rather flexible. In other federations, amendments to the Constitution can be made only with the consent and approval of the units. In India, the Parliament can amend most of the provisions of the Constitution single-handedly, either by a simple majority or by a two-thirds majority.\n4.  **Single Citizenship:** The Indian Constitution provides for single citizenship of India which is common to all the people of various States and Union Territories.\n5.  **Inequality of Representation in the Rajya Sabha:** Our Constitution does not accord equal representation to all the States. It accords representation to the various States in the Rajya Sabha on the basis of their population. This means that the States with larger populations send more representatives in comparison to the States with smaller population. Further, the Rajya Sabha also has 12 members nominated by the President from amongst persons who have specialised in the field of art, literature, science and social services. This is a clear departure from the federal principle.\n6.  **Existence of Union Territories:** Another feature, which is a clear pointer to the unitary character of the Indian Constitution, is the existence of administrative units known as the Union Territories. These units are directly governed by the Central Government and do not enjoy any independent powers or autonomy."
    },
    {
      "title": "THE UNION PARLIAMENT",
      "content_md": "The Union Legislature comprises the President and the two Houses of Parliament: the House of the People (the Lok Sabha) and the Council of States (the Rajya Sabha).\n\nIn a democracy, people are their own masters. Ours is a representative democracy where people exercise their sovereign power through their elected representatives. The Parliament is the body of people's representatives who have supreme power of governance in a democratic country."
    },
    {
      "title": "ROLE AND FUNCTIONS OF THE SPEAKER",
      "content_md": "The role and functions of the Speaker may be categorised under the following heads:\n\n**The Business of the House**\n1. The Speaker presides over the meetings of the House. All speeches and remarks are addressed to the Speaker. He/She allots time for discussion.\n2. The Speaker interprets the rules of procedure of the House. His/Her decision in all parliamentary matters is final.\n3. All Bills passed by the House are signed by him/her before they are sent to the Rajya Sabha for its consideration or to the President for assent.\n4. The Speaker decides the admissibility of all questions and resolutions. He/She decides the admissibility of a motion of adjournment.\n5. He/She puts the issues to vote and announces the results. The Speaker does not vote in the House, except when there are equal votes on both sides, i.e., the Treasury Benches and the Opposition.\n6. The Speaker decides whether a Bill is a Money Bill or not.\n\n**Administrative Functions**\n1. The Speaker receives all petitions and documents in the House.\n2. He/She communicates the decisions of the House to the concerned authorities.\n3. He/She regulates the admission of visitors and Press correspondents to the galleries of the House.\n\n**Disciplinary Functions**\n1. The Speaker maintains order in the House. When members become unruly, he/she may order them to withdraw. He may suspend a member, if he/she disregards the authority of the Chair. In case of grave disorder, he/she can adjourn the House.\n2. In case the words used by a member are indecent or unparliamentary, the Speaker may order that such words be expunged from the proceedings of the House.\n3. The Speaker decides whether there is a case for a matter relating to a breach of privilege or contempt of the House.\n4. In regard to a question whether a Member of Lok Sabha stands disqualified under Anti-Defection Law, the question shall be referred to the decision of the Speaker. The Constitution says that Speaker's decision shall be final and no court shall have any jurisdiction in this regard.\n\n**Parliamentary Committees**\n1. The Speaker is the ex-officio Chairman of some of the Committees of the House, such as the Business Advisory Committee and the Rules Committee.\n2. He/She appoints Chairmen of all the Committees of the House.\n3. He/She issues directions to the Chairmen in all matters relating to their working and the procedure to be followed.\n\n**Miscellaneous Functions**\n1. The Speaker presides over the joint sessions of both the Houses of Parliament.\n2. In consultation with the Chairman of the Rajya Sabha, he/she nominates personnel for Parliamentary Delegations to various countries.\n3. He/she presides over the Conference of Presiding Officers of legislative bodies in India."
    }
  ],
  "needs_review": [],
  "manifest": {
    "syllabus_leaves": [
      {
        "path": "The Union Legislature > Meaning of the Federal Setup in India",
        "path_titles": [
          "The Union Legislature",
          "Meaning of the Federal Setup in India"
        ],
        "title": "Meaning of the Federal Setup in India",
        "sequence_number": 1,
        "depth": 1,
        "level_label": "Topic",
        "has_notes": true
      },
      {
        "path": "The Union Legislature > Lok Sabha > Term",
        "path_titles": [
          "The Union Legislature",
          "Lok Sabha",
          "Term"
        ],
        "title": "Term",
        "sequence_number": 1,
        "depth": 2,
        "level_label": "Subtopic",
        "has_notes": true
      },
      {
        "path": "The Union Legislature > Lok Sabha > Composition",
        "path_titles": [
          "The Union Legislature",
          "Lok Sabha",
          "Composition"
        ],
        "title": "Composition",
        "sequence_number": 2,
        "depth": 2,
        "level_label": "Subtopic",
        "has_notes": true
      },
      {
        "path": "The Union Legislature > Lok Sabha > Qualifications for Membership",
        "path_titles": [
          "The Union Legislature",
          "Lok Sabha",
          "Qualifications for Membership"
        ],
        "title": "Qualifications for Membership",
        "sequence_number": 3,
        "depth": 2,
        "level_label": "Subtopic",
        "has_notes": true
      },
      {
        "path": "The Union Legislature > Lok Sabha > Disqualification of Membership",
        "path_titles": [
          "The Union Legislature",
          "Lok Sabha",
          "Disqualification of Membership"
        ],
        "title": "Disqualification of Membership",
        "sequence_number": 4,
        "depth": 2,
        "level_label": "Subtopic",
        "has_notes": true
      },
      {
        "path": "The Union Legislature > Lok Sabha > Vacation of Seats",
        "path_titles": [
          "The Union Legislature",
          "Lok Sabha",
          "Vacation of Seats"
        ],
        "title": "Vacation of Seats",
        "sequence_number": 5,
        "depth": 2,
        "level_label": "Subtopic",
        "has_notes": true
      },
      {
        "path": "Parliamentary procedures > Sessions",
        "path_titles": [
          "Parliamentary procedures",
          "Sessions"
        ],
        "title": "Sessions",
        "sequence_number": 1,
        "depth": 1,
        "level_label": "Topic",
        "has_notes": true
      },
      {
        "path": "Parliamentary procedures > Quorum",
        "path_titles": [
          "Parliamentary procedures",
          "Quorum"
        ],
        "title": "Quorum",
        "sequence_number": 2,
        "depth": 1,
        "level_label": "Topic",
        "has_notes": true
      },
      {
        "path": "Parliamentary procedures > Questions > Question Hour",
        "path_titles": [
          "Parliamentary procedures",
          "Questions",
          "Question Hour"
        ],
        "title": "Question Hour",
        "sequence_number": 1,
        "depth": 2,
        "level_label": "Subtopic",
        "has_notes": true
      },
      {
        "path": "Parliamentary procedures > Questions > Types of Questions",
        "path_titles": [
          "Parliamentary procedures",
          "Questions",
          "Types of Questions"
        ],
        "title": "Types of Questions",
        "sequence_number": 2,
        "depth": 2,
        "level_label": "Subtopic",
        "has_notes": true
      },
      {
        "path": "Parliamentary procedures > Zero Hour",
        "path_titles": [
          "Parliamentary procedures",
          "Zero Hour"
        ],
        "title": "Zero Hour",
        "sequence_number": 4,
        "depth": 1,
        "level_label": "Topic",
        "has_notes": true
      },
      {
        "path": "Parliamentary procedures > Motion",
        "path_titles": [
          "Parliamentary procedures",
          "Motion"
        ],
        "title": "Motion",
        "sequence_number": 5,
        "depth": 1,
        "level_label": "Topic",
        "has_notes": true
      },
      {
        "path": "Parliamentary procedures > Adjournment Motion",
        "path_titles": [
          "Parliamentary procedures",
          "Adjournment Motion"
        ],
        "title": "Adjournment Motion",
        "sequence_number": 6,
        "depth": 1,
        "level_label": "Topic",
        "has_notes": true
      },
      {
        "path": "Parliamentary procedures > No-Confidence Motion",
        "path_titles": [
          "Parliamentary procedures",
          "No-Confidence Motion"
        ],
        "title": "No-Confidence Motion",
        "sequence_number": 7,
        "depth": 1,
        "level_label": "Topic",
        "has_notes": true
      },
      {
        "path": "Parliamentary procedures > Adjournment and Prorogation of the House",
        "path_titles": [
          "Parliamentary procedures",
          "Adjournment and Prorogation of the House"
        ],
        "title": "Adjournment and Prorogation of the House",
        "sequence_number": 8,
        "depth": 1,
        "level_label": "Topic",
        "has_notes": true
      },
      {
        "path": "Anti-Defection Law",
        "path_titles": [
          "Anti-Defection Law"
        ],
        "title": "Anti-Defection Law",
        "sequence_number": 3,
        "depth": 0,
        "level_label": "Section",
        "has_notes": true
      },
      {
        "path": "Passing of Bills > Ordinary Bills",
        "path_titles": [
          "Passing of Bills",
          "Ordinary Bills"
        ],
        "title": "Ordinary Bills",
        "sequence_number": 1,
        "depth": 1,
        "level_label": "Topic",
        "has_notes": true
      },
      {
        "path": "Passing of Bills > Money Bills",
        "path_titles": [
          "Passing of Bills",
          "Money Bills"
        ],
        "title": "Money Bills",
        "sequence_number": 2,
        "depth": 1,
        "level_label": "Topic",
        "has_notes": true
      },
      {
        "path": "Speaker of the Lok Sabha",
        "path_titles": [
          "Speaker of the Lok Sabha"
        ],
        "title": "Speaker of the Lok Sabha",
        "sequence_number": 5,
        "depth": 0,
        "level_label": "Section",
        "has_notes": true
      }
    ],
    "stray_leaves": [
      {
        "title": "Non-Federal or Unitary Features",
        "insert_after_index": 1,
        "micro_topics": [
          "A Strong Centre",
          "A Single Constitution for Union and States",
          "Flexibility of the Constitution",
          "Single Citizenship",
          "Inequality of Representation in the Rajya Sabha",
          "Existence of Union Territories"
        ],
        "has_notes": true
      },
      {
        "title": "THE UNION PARLIAMENT",
        "insert_after_index": 1,
        "micro_topics": [],
        "has_notes": true
      },
      {
        "title": "ROLE AND FUNCTIONS OF THE SPEAKER",
        "insert_after_index": 24,
        "micro_topics": [
          "The Business of the House",
          "Administrative Functions",
          "Disciplinary Functions",
          "Parliamentary Committees",
          "Miscellaneous Functions"
        ],
        "has_notes": true
      }
    ]
  }
}